#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x40 (0x2B0 - 0x270)
// Class FortniteUI.FortHUDElementWidget
class UFortHUDElementWidget : public UCommonUserWidget
{
public:
	uint8                                        Pad_77[0x8];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          ElementTag;                                        // 0x278(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                 HUDElementTag;                                     // 0x280(0x20)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	enum class ESlateVisibility                  HiddenVisibility;                                  // 0x2A0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_78[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class UTutorialHighlight*                    TutorialHighlight;                                 // 0x2A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortHUDElementWidget* GetDefaultObj();

	void OnVisibilitySetEvent(enum class ESlateVisibility InVisibility);
	bool HasAnyTags(struct FGameplayTagContainer& InTags);
	void HandleOnHUDElementVisibilityChanged(struct FGameplayTagContainer& HiddenHUDElementTags);
	void AppendHUDElementTags(struct FGameplayTagContainer& AdditionalTags);
};

// 0x38 (0x2E8 - 0x2B0)
// Class FortniteUI.FortActorIndicatorWidget
class UFortActorIndicatorWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_8E[0x8];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                IndicatedActor;                                    // 0x2B8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPrimitiveComponent*                   IndicatedActorComponent;                           // 0x2C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               RelativeLocation;                                  // 0x2C8(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxDistance;                                       // 0x2D4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bClampOnScreen;                                    // 0x2D8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShowClampToScreenArrow;                           // 0x2D9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseScreenSpacePosition;                           // 0x2DA(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_91[0x1];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             ScreenSpaceRelativeOffset;                         // 0x2DC(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        ScreenPriority;                                    // 0x2E4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortActorIndicatorWidget* GetDefaultObj();

	void SetIndicatedActor(class AActor* NewIndicatorActor);
	bool IsIndicatingActor(class AActor* OtherActor);
};

// 0x50 (0xF48 - 0xEF8)
// Class FortniteUI.FortRadialSlot
class UFortRadialSlot : public UCommonButtonLegacy
{
public:
	uint8                                        Pad_97[0x10];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonLazyImage*                      Image_Icon;                                        // 0xF08(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_Main;                                         // 0xF10(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                               Overlay_EquippedItem;                              // 0xF18(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UTexture2D>             LockedTexture;                                     // 0xF20(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortRadialSlot* GetDefaultObj();

};

// 0x8 (0xF50 - 0xF48)
// Class FortniteUI.FortRadialPickerEntry
class UFortRadialPickerEntry : public UFortRadialSlot
{
public:
	uint8                                        Pad_9C[0x8];                                       // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortRadialPickerEntry* GetDefaultObj();

	void OnAvailabilityChanged(bool bIsAvailable);
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortUIGameFeatureAction
class UFortUIGameFeatureAction : public UGameFeatureAction
{
public:

	static class UClass* StaticClass();
	static class UFortUIGameFeatureAction* GetDefaultObj();

};

// 0x0 (0x270 - 0x270)
// Class FortniteUI.FortGlobalSeasonResourceWidget
class UFortGlobalSeasonResourceWidget : public UCommonUserWidget
{
public:

	static class UClass* StaticClass();
	static class UFortGlobalSeasonResourceWidget* GetDefaultObj();

};

// 0x88 (0xF30 - 0xEA8)
// Class FortniteUI.FortHoldableButton
class UFortHoldableButton : public UCommonButtonBase
{
public:
	bool                                         bIsHoldableButton;                                 // 0xEA8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIgnoreLongPress;                                  // 0xEA9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_B1[0x2];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        HoldTime;                                          // 0xEAC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        StartingHoldPercentage;                            // 0xEB0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        QualifyingHoldTime;                                // 0xEB4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bHoldCancelledFromMovement;                        // 0xEB8(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_B4[0x77];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortHoldableButton* GetDefaultObj();

	void BP_OnPressed();
	void BP_OnHoldStarted(float HoldPercentage, bool bInUseSecondaryHoldAnimation);
	void BP_OnHoldReset();
	void BP_OnHoldIncreased(float HoldPercentage);
	void BP_OnHoldEnded(float HoldPercentage, bool bInUseSecondaryHoldAnimation);
	void BP_OnHoldDecreased(float HoldPercentage);
	void BP_OnHoldCompleted();
};

// 0x38 (0x4A0 - 0x468)
// Class FortniteUI.FortActivatablePanel
class UFortActivatablePanel : public UCommonActivatablePanelLegacy
{
public:
	uint8                                        Pad_C0[0x8];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bIsPushedOnToContentPanelStack;                    // 0x470(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsAlreadyOnContentPanelStack;                     // 0x471(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EInputPriority                    InputPriority;                                     // 0x472(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsClosableByPlayerInput;                          // 0x473(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPrimaryContentSetup                  PrimaryContentSetup;                               // 0x474(0x1)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_C1[0x2B];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortActivatablePanel* GetDefaultObj();

	void RestoreScrollWidget(class UWidget* FallbackWidget);
	void RestoreCenterWidget(class UWidget* FallbackWidget);
	void AsyncPlaySound2D(class UObject* WorldContextObject, TSoftObjectPtr<class USoundBase> SoundToLoad, float VolumeMultiplier, float PitchMultiplier, float StartTime);
};

// 0x138 (0x5D8 - 0x4A0)
// Class FortniteUI.FortItemPreviewScreen
class UFortItemPreviewScreen : public UFortActivatablePanel
{
public:
	uint8                                        Pad_C8[0x10];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   ItemViewUnifiedSupportsCameraControlInputAction;   // 0x4B0(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewUnifiedZoomInputAction;                    // 0x4C0(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewZoomOutInputAction;                        // 0x4D0(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewZoomInInputAction;                         // 0x4E0(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewRotateInputAction;                         // 0x4F0(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                      AnimationToHideItemInfo;                           // 0x500(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAutoShowDetails;                                  // 0x508(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bItemDetailsHidden;                                // 0x509(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_C9[0x2];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        HideItemInfoHeaderDurationSecs;                    // 0x50C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_CA[0x8];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bAllowItemRotation;                                // 0x518(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAllowItemZooming;                                 // 0x519(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EFrontEndCamera                   FrontEndCamera;                                    // 0x51A(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_CB[0x1];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          PreviewSceneChangerTag;                            // 0x51C(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                          PreviewSceneChangerOverrideTag;                    // 0x524(0x8)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_CD[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortItemPreviewSceneChanger*          PreviewSceneChanger;                               // 0x530(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItemView*                         ItemViewObject;                                    // 0x538(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        CameraEntryTransitionDuration;                     // 0x540(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_CF[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class UCurveFloat*                           CameraEntryTransitionCurve;                        // 0x548(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_D0[0x70];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UWidget*                               Widget_CameraFrame;                                // 0x5C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   Button_PreviewAction;                              // 0x5C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonActivatableWidget*              OverrideFocusWidget;                               // 0x5D0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortItemPreviewScreen* GetDefaultObj();

	void ShowItemDetails();
	void OnPreviewActionButtonUpdated(class FText& RowDisplayName);
	void HideItemDetails();
};

// 0x198 (0x770 - 0x5D8)
// Class FortniteUI.BattlePassScreenBase
class UBattlePassScreenBase : public UFortItemPreviewScreen
{
public:
	struct FDataTableRowHandle                   RefundGiftToken;                                   // 0x5D8(0x10)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_DA[0x8];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class UFortSeasonLevelConfirmationScreen> SeasonLevelPurchaseScreenClass;                    // 0x5F0(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UAthenaAboutModal>       SeasonAboutScreenClass;                            // 0x618(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                 WrapPreviewExcludedTags;                           // 0x640(0x20)(Edit, Protected, NativeAccessSpecifierProtected)
	enum class EBattlePassView                   CurrentView;                                       // 0x660(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_DB[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaSeasonItemDefinition*           SeasonData;                                        // 0x668(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortItemPreviewWorld*                 CachedVaultWorld;                                  // 0x670(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAccountItemDefinition*            LastViewedItem;                                    // 0x678(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_DC[0xF0];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBattlePassScreenBase* GetDefaultObj();

	bool ShouldPlayBPVideo(bool bAllowUpdate);
	void OnWatchVideo();
	void OnViewReward(const struct FFortRarityItemData& Rarity, bool bNoReward, class UFortItemDefinition* RewardItem);
	void OnVariantUpdate(int32 CurrentIndex, int32 TotalNumVariants);
	void OnSetPurchasedAnnualPass(bool bIsPurchased);
	void OnSetDifferentBPText();
	void OnRequestViewRewardComplete();
	void OnRequestViewReward();
	void OnNoCurrentSeason();
	void OnBattlePassViewChanged(enum class EBattlePassView NewView);
	int32 GetNumberOfRewardsToPurchase();
};

// 0x10 (0x2C0 - 0x2B0)
// Class FortniteUI.FortWeaponReticleExtensionWidgetBase
class UFortWeaponReticleExtensionWidgetBase : public UFortHUDElementWidget
{
public:
	class AFortWeapon*                           CachedAssociatedWeapon;                            // 0x2B0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_FA[0x8];                                       // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortWeaponReticleExtensionWidgetBase* GetDefaultObj();

	void OnWeaponSingleFire();
	void OnWeaponReloadStarted(float ReloadTime, enum class EFortWeaponReloadType ReloadType);
	void OnWeaponReloadCancelled();
	void OnTargetingChanged(bool bIsADS);
	void OnFullyExitVehicle();
	void HandleTargetingChanged(bool bNewIsADS);
	void HandleFullyExitVehicle();
	void HandleEnterVehiclePassenger();
	void HandleEnterVehicleDriver();
	bool GetIsADS();
	class AFortWeapon* GetEquippedWeapon();
};

// 0x18 (0x40 - 0x28)
// Class FortniteUI.FortMobileHUDWidgetBehaviorExtension
class UFortMobileHUDWidgetBehaviorExtension : public UObject
{
public:
	TArray<class UFortMobileHudWidgetContentComponent*> HUDWidgetContentComponents;                        // 0x28(0x10)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UHUDWidgetBehavior*                    OwnerWidgetBehavior;                               // 0x38(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortMobileHUDWidgetBehaviorExtension* GetDefaultObj();

};

// 0x20 (0x60 - 0x40)
// Class FortniteUI.FortMobileActionButtonBehaviorExtension
class UFortMobileActionButtonBehaviorExtension : public UFortMobileHUDWidgetBehaviorExtension
{
public:
	TArray<class FName>                          ActionNames;                                       // 0x40(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UFortMobileButtonBehaviorComponent*> ButtonBehaviorComponents;                          // 0x50(0x10)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortMobileActionButtonBehaviorExtension* GetDefaultObj();

};

// 0x18 (0xEC0 - 0xEA8)
// Class FortniteUI.AthenaQuickBarSlotButtonBase
class UAthenaQuickBarSlotButtonBase : public UCommonButtonBase
{
public:
	enum class EFortQuickBars                    QuickbarIndex;                                     // 0xEA8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_109[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SlotIndex;                                         // 0xEAC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaItemIcon*                       ItemIcon;                                          // 0xEB0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_10A[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaQuickBarSlotButtonBase* GetDefaultObj();

	void OnSlottedItemChanged(class UFortItem* SlottedItem);
	void OnOwnerDeactivated();
	void OnOwnerActivated();
	void HandleQuickbarContentsChanged(enum class EFortQuickBars InQuickBarIndex, TArray<int32>& ChangedSlots);
	void HandleInventoryItemSelected(class UFortItem* SelectedItem);
};

// 0x8 (0x278 - 0x270)
// Class FortniteUI.AthenaQuickBarSlotExtensionWidgetBase
class UAthenaQuickBarSlotExtensionWidgetBase : public UCommonUserWidget
{
public:
	uint8                                        Pad_10D[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaQuickBarSlotExtensionWidgetBase* GetDefaultObj();

	void OnOwnerUnhovered();
	void OnOwnerSelected();
	void OnOwnerHovered();
	void OnOwnerDeselected();
	void OnOwnerDeactivated();
	void OnOwnerActivated();
	void OnItemChanged(class UFortItem* Item);
};

// 0x90 (0x340 - 0x2B0)
// Class FortniteUI.FortAthenaVehicleDashboardWidget
class UFortAthenaVehicleDashboardWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_125[0xC];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bIsWidgetShowing;                                  // 0x2BC(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_126[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortAthenaVehicle*                    CurrentVehicleActor;                               // 0x2C0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CurrentSpeed;                                      // 0x2C8(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TargetFuelPercent;                                 // 0x2CC(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DisplayedFuelPercent;                              // 0x2D0(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FillBlendSpeed;                                    // 0x2D4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SpeedTextMaxInterpolationRate;                     // 0x2D8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_127[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 WidgetTagsToHideWhenVisible;                       // 0x2E0(0x20)(Edit, NativeAccessSpecifierPrivate)
	uint8                                        Pad_128[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        HUDTopSpeed;                                       // 0x304(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EHorizontalAlignment              MobileFuelGaugeHorizontalAlignment;                // 0x308(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EVerticalAlignment                MobileFuelGaugeVerticalAlignment;                  // 0x309(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_129[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FMargin                               MobileFuelGaugePadding;                            // 0x30C(0x10)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_12A[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonNumericTextBlock*               NumericText_Speed;                                 // 0x320(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                              Overlay_Gauge;                                     // 0x328(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ItemName;                                     // 0x330(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_12B[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAthenaVehicleDashboardWidget* GetDefaultObj();

	void UpdateSpeedometer(float NormalizedSpeed);
	void ShowNoFuelMessage();
	void SetVehicleUsesRechargableBoost(bool bUsesRechargeableBoost);
	void SetVehicleHasInfiniteFuel(bool bInfiniteFuel);
	void SetupVehicleFuelWidget(class AActor* NewVehicle, bool bRequestShowWidget);
	void OnWidgetVisibilityChanged(bool bNewVisibility);
	void OnUpdateRechargeableBoostPercent(float BoostPercent);
	void OnUpdateBoostChargePercent(float BoostPercent);
	void OnRPMChanged(float NormalizedRPM);
	void OnRechargableBoostFilled();
	void OnPlayerFacingNameUpdated();
	void OnOutOfFuel();
	void OnLowFuel();
	void OnFuelValueChanged(float FuelPercentage, bool bIsLowOnFuel);
	void OnBoostStarted();
	void OnBoostFinished();
	void OnBoostChargeFilled();
	void OnAddedFuel(float NewFuelPercent);
	class AFortAthenaVehicle* GetVehicle();
	float GetHUDTopSpeed();
};

// 0x88 (0xB0 - 0x28)
// Class FortniteUI.HUDWidgetBehavior
class UHUDWidgetBehavior : public UObject
{
public:
	class FText                                  HUDLayoutToolName;                                 // 0x28(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TArray<class UFortMobileHudWidgetContentComponent*> HUDWidgetContentComponents;                        // 0x40(0x10)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, class FString>     CustomPropertyDefaultOverrides;                    // 0x50(0x50)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<class UFortMobileHUDWidgetBehaviorExtension*> BehaviorExtensions;                                // 0xA0(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UHUDWidgetBehavior* GetDefaultObj();

};

// 0x48 (0xF8 - 0xB0)
// Class FortniteUI.FortMobileActionButtonBehavior
class UFortMobileActionButtonBehavior : public UHUDWidgetBehavior
{
public:
	TArray<class FName>                          ActionNames;                                       // 0xB0(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UPaperSprite*                          Sprite;                                            // 0xC0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                          HUDLayoutToolSaveTag_Legacy;                       // 0xC8(0x8)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_12D[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UFortMobileButtonBehaviorComponent*> ButtonBehaviorComponents;                          // 0xE0(0x10)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	int32                                        ForcedZOrder;                                      // 0xF0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_12E[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortMobileActionButtonBehavior* GetDefaultObj();

};

// 0x40 (0x370 - 0x330)
// Class FortniteUI.CMSBackgroundWidget
class UCMSBackgroundWidget : public UCommonActivatableWidget
{
public:
	uint8                                        Pad_130[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        OlderBackgroundStreamoutSeconds;                   // 0x348(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bDeactivateOnClose;                                // 0x34C(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_131[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UImage*                                Image_Background;                                  // 0x350(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_Close;                                      // 0x358(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_MobileClose;                                // 0x360(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_133[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCMSBackgroundWidget* GetDefaultObj();

	void OnStartingDownloadBackground();
	void OnDownloadBackgroundComplete(class UTexture2D* NewBackground);
};

// 0x20 (0xEC8 - 0xEA8)
// Class FortniteUI.FortTabButton
class UFortTabButton : public UCommonButtonBase
{
public:
	uint8                                        Pad_134[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonLazyImage*                      LazyImage_Icon;                                    // 0xEB0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_Title;                                        // 0xEB8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector2D                             ImageSize_Mobile;                                  // 0xEC0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortTabButton* GetDefaultObj();

	void SetTabLabelInfo_Implementation(struct FFortTabButtonLabelInfo& TabLabelInfo);
};

// 0x28 (0x2D8 - 0x2B0)
// Class FortniteUI.FortMobileHUDElement
class UFortMobileHUDElement : public UFortHUDElementWidget
{
public:
	struct FGameplayTag                          SizePropertyTag;                                   // 0x2B0(0x8)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_135[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ForcedZOrder;                                      // 0x2C8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_136[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UScaleBox*                             ScaleBox_HUDWidgetScale;                           // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortMobileHUDElement* GetDefaultObj();

};

// 0x20 (0x2F8 - 0x2D8)
// Class FortniteUI.BacchusHUDElement
class UBacchusHUDElement : public UFortMobileHUDElement
{
public:
	bool                                         bHideWhenNotUsingTouch;                            // 0x2D8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUpdatesWithHUDState;                              // 0x2D9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAlwaysShow;                                       // 0x2DA(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInBuildMode;                                     // 0x2DB(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInCombatMode;                                    // 0x2DC(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInEditMode;                                      // 0x2DD(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInCreativeMode;                                  // 0x2DE(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInBattleLabMode;                                 // 0x2DF(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              IsFreeFalling;                                     // 0x2E0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              IsGliding;                                         // 0x2E1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              CanOpenChute;                                      // 0x2E2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              InLockedBus;                                       // 0x2E3(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              InUnlockedBus;                                     // 0x2E4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnTargeting;                                       // 0x2E5(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnUsingScopeTargeting;                             // 0x2E6(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCanTarget;                                       // 0x2E7(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCanUseScopeTargeting;                            // 0x2E8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCrouching;                                       // 0x2E9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCanUseSecondaryAbility;                          // 0x2EA(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnDBNO;                                            // 0x2EB(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCarryingDBNO;                                    // 0x2EC(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCarryingHeldObject;                              // 0x2ED(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnControllingRCPawn;                               // 0x2EE(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInVehicle;                                       // 0x2EF(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnDrivingVehicle;                                  // 0x2F0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnZiplining;                                       // 0x2F1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_13D[0x6];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBacchusHUDElement* GetDefaultObj();

	void ShowHighlight(bool Show);
	void OnHUDStateUpdate(struct FFortHUDState& NewState);
	void HandleInputMethodChanged(enum class ECommonInputType CurrentInputType);
};

// 0x78 (0x370 - 0x2F8)
// Class FortniteUI.BacchusButton
class UBacchusButton : public UBacchusHUDElement
{
public:
	class UPaperSprite*                          DefaultIcon;                                       // 0x2F8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          PressedColor;                                      // 0x300(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          UnpressedColor;                                    // 0x310(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EButtonClickMethod                ClickMethod;                                       // 0x320(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EButtonTouchMethod                TouchMethod;                                       // 0x321(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_143[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ButtonSize;                                        // 0x324(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ButtonDisplayScale;                                // 0x328(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         ShowRadialProgress;                                // 0x32C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_144[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          ListenedGamePlayTag;                               // 0x330(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Image_Background;                                  // 0x338(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_145[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class USizeBox*                              SizeBox_ButtonSize;                                // 0x348(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USizeBox*                              SizeBox_ImageSize;                                 // 0x350(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_Icon;                                        // 0x358(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URadialBacchusButtonBase*              RadialButton_ButtonCooldown;                       // 0x360(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UButton*                               Button_InternalButton;                             // 0x368(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBacchusButton* GetDefaultObj();

	void SetIconPressed(bool bIsPressed);
	void SetDefaultIcon(class UPaperSprite* Icon);
	void SetButtonSprite(class UPaperSprite* NewSprite);
	void SetButtonSize(float NewButtonSize);
	void SetButtonDisplayScale(float NewDisplayScale);
	void OnClicked();
	void HandleCursorModeChanged(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CustomWidget);
};

// 0x48 (0x3B8 - 0x370)
// Class FortniteUI.BacchusActionButton
class UBacchusActionButton : public UBacchusButton
{
public:
	TArray<struct FBacchusActionIconMapping>     ActionMapping;                                     // 0x370(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class FName                                  TempActionMapping;                                 // 0x380(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FGameplayTag>                  ItemsAllowingClickThrough;                         // 0x388(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                         bCapturesInput;                                    // 0x398(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_149[0x1F];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBacchusActionButton* GetDefaultObj();

	void OnCursorModeChanged(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CustomWidget);
	void AddActionMappings(const TArray<struct FBacchusActionIconMapping>& NewActionMappings);
};

// 0x58 (0x308 - 0x2B0)
// Class FortniteUI.LTMWidgetBase
class ULTMWidgetBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_14E[0x40];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class AFortGameplayMutator>      MutatorClassToWaitFor;                             // 0x2F0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortGameplayMutator*                  CachedGameplayMutator;                             // 0x2F8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_14F[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortPrioritizedWidgetData            PrioritizationData;                                // 0x301(0x2)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_150[0x5];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ULTMWidgetBase* GetDefaultObj();

	void SetPlayerPortrait(class AFortPlayerStateAthena* Player, class UFortLazyImage* PortraitImage);
	void OnStompFailed();
	void OnStompedByOtherWidget();
	void OnMutatorAvailable_BP(class AFortGameplayMutator* MutatorActor);
	void OnHandleSpectatingChanged(class AFortPlayerStateZone* SpectatingTarget);
	void OnGamePhaseChanged(enum class EAthenaGamePhase NewPhase);
	void K2_OnBecomeInactive();
	void K2_OnBecomeActive();
	bool K2_HasActiveContent();
	uint8 GetViewingTeam();
	class AFortPlayerStateAthena* GetViewingPlayerState();
};

// 0x8 (0x30 - 0x28)
// Class FortniteUI.FortMobileButtonBehaviorComponent
class UFortMobileButtonBehaviorComponent : public UObject
{
public:
	class UFortMobileActionButtonBehavior*       ButtonBehavior;                                    // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortMobileButtonBehaviorComponent* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class FortniteUI.FortMobileButtonBehaviorComponent_Visibility
class UFortMobileButtonBehaviorComponent_Visibility : public UFortMobileButtonBehaviorComponent
{
public:

	static class UClass* StaticClass();
	static class UFortMobileButtonBehaviorComponent_Visibility* GetDefaultObj();

};

// 0x38 (0x368 - 0x330)
// Class FortniteUI.FortOptionsTab
class UFortOptionsTab : public UCommonActivatableWidget
{
public:
	FMulticastInlineDelegateProperty_            OnTabSettingChanged;                               // 0x330(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, BlueprintCallable, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_            OnTabActivated;                                    // 0x340(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_            OnTabDeactivated;                                  // 0x350(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	enum class ESettingTab                       TabType;                                           // 0x360(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_154[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortOptionsTab* GetDefaultObj();

	void UpdateOptionsTab();
	void TempNew_UpdateOptionsTab();
	void ResetOptionsToDefault();
	bool IsControllerDefaultInputType();
	bool IsAthena();
	void DeactivateTab();
	void CenterOnTab();
	bool AreParentalControlsEnabled();
	void ActivateTab();
};

// 0xA8 (0x318 - 0x270)
// Class FortniteUI.FortRadialMenu
class UFortRadialMenu : public UCommonUserWidget
{
public:
	TSubclassOf<class UUserWidget>               EntryWidgetClass;                                  // 0x270(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_155[0x78];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        JoystickDeadZone;                                  // 0x2F0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MouseDeadZoneRadiusPercentage;                     // 0x2F4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        JoystickMaximumMagnitude;                          // 0x2F8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRadialBoxSettings                    RadialBoxSettings;                                 // 0x2FC(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	enum class EFortRadialControllingStick       ControllingStick;                                  // 0x30C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAllowEmptySelection;                              // 0x30D(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAllowFullMovement;                                // 0x30E(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_156[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UDynamicEntryBox*                      EntryBox_ContextRadial;                            // 0x310(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortRadialMenu* GetDefaultObj();

	int32 GetNumEntries();
	float GetDegreeOffset();
	float GetDegreeIncrements();
	float GetAngleForIndex(int32 Index);
};

// 0x38 (0x350 - 0x318)
// Class FortniteUI.FortSlottedRadialMenu
class UFortSlottedRadialMenu : public UFortRadialMenu
{
public:
	enum class ERadialOrderingMode               OrderingMode;                                      // 0x318(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_157[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<enum class ECardinalPoint>            CustomOrdering;                                    // 0x320(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	bool                                         bUseAsManySlotsAsItems;                            // 0x330(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_158[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NumSlotsSupported;                                 // 0x334(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_159[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortSlottedRadialMenu* GetDefaultObj();

};

// 0x118 (0x218 - 0x100)
// Class FortniteUI.FortVoiceChatStatusIcon
class UFortVoiceChatStatusIcon : public UWidget
{
public:
	uint8                                        Pad_15A[0x28];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             DesiredSize;                                       // 0x128(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSlateColor                           ImageColorAndOpacity;                              // 0x130(0x14)(Edit, NativeAccessSpecifierPrivate)
	uint8                                        Pad_15B[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UMaterialInterface*                    VoiceChatStatusMaterial;                           // 0x148(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSlateBrush                           StatusBrush;                                       // 0x150(0xB0)(Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_15C[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortVoiceChatStatusIcon* GetDefaultObj();

	void SetImageColorAndOpacity(struct FSlateColor& InColorAndOpacity);
};

// 0x38 (0x250 - 0x218)
// Class FortniteUI.FortVoiceChatStatusIconProxyAnim
class UFortVoiceChatStatusIconProxyAnim : public UFortVoiceChatStatusIcon
{
public:
	float                                        TalkingRampUpSeconds;                              // 0x218(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        TalkingRampDownSeconds;                            // 0x21C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        TalkingUpdatesPerSecond;                           // 0x220(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_15D[0x2C];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortVoiceChatStatusIconProxyAnim* GetDefaultObj();

};

// 0x148 (0x478 - 0x330)
// Class FortniteUI.AthenaAboutModal
class UAthenaAboutModal : public UCommonActivatableWidget
{
public:
	FMulticastInlineDelegateProperty_            BP_OnAboutModalClosed;                             // 0x330(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                         bForceShowPage;                                    // 0x340(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15E[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Title;                                             // 0x348(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	TArray<class FText>                          Entries;                                           // 0x360(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UObject>                HeroImage;                                         // 0x370(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                BPSTrailerVideoUID;                                // 0x398(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                BPSHowToVideoUID;                                  // 0x3A8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UFortActivatableMovieWidget> SeasonMovieWidgetClass;                            // 0x3B8(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortStreamMediaSource*                VideoStream_Source;                                // 0x3E0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScrollBox*                            ScrollBox_Content;                                 // 0x3E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                        Image_Item;                                        // 0x3F0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   Button_Close;                                      // 0x3F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   Button_Close_Mobile;                               // 0x400(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   Button_BPSTrailer;                                 // 0x408(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   Button_BPSTrailer_Mobile;                          // 0x410(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   Button_BPSHowTo;                                   // 0x418(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   Button_BPSHowTo_Mobile;                            // 0x420(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_15F[0x50];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaAboutModal* GetDefaultObj();

	void OnSetContent(class FText& InTitle, TArray<class FText>& InEntries);
	void OnAboutModalClosedDynamic__DelegateSignature();
	void CloseModal();
};

// 0x8 (0x3C0 - 0x3B8)
// Class FortniteUI.AlternativeCarryPickupButton
class UAlternativeCarryPickupButton : public UBacchusActionButton
{
public:
	uint8                                        Pad_160[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAlternativeCarryPickupButton* GetDefaultObj();

};

// 0x20 (0x490 - 0x470)
// Class FortniteUI.AthenaLoadingScreenPreviewPanelBase
class UAthenaLoadingScreenPreviewPanelBase : public UAthenaLoadingScreenPreviewPanel
{
public:
	class UNativeWidgetHost*                     LoadingScreenSlot;                                 // 0x470(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_161[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonButtonLegacy*                   Button_Close;                                      // 0x480(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonLegacy*                   Button_CloseMobile;                                // 0x488(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaLoadingScreenPreviewPanelBase* GetDefaultObj();

};

// 0x8 (0x498 - 0x490)
// Class FortniteUI.ApolloIntroLoadingPanel
class UApolloIntroLoadingPanel : public UAthenaLoadingScreenPreviewPanelBase
{
public:
	class UFortPlaylistAthena*                   ApolloIntroPlaylist;                               // 0x490(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UApolloIntroLoadingPanel* GetDefaultObj();

};

// 0x0 (0x248 - 0x248)
// Class FortniteUI.ApolloIntroShimBase
class UApolloIntroShimBase : public UUserWidget
{
public:

	static class UClass* StaticClass();
	static class UApolloIntroShimBase* GetDefaultObj();

	void HandleGamePhaseChanged(enum class EAthenaGamePhase GamePhase);
};

// 0x18 (0x320 - 0x308)
// Class FortniteUI.AshtonWidgetBase
class UAshtonWidgetBase : public ULTMWidgetBase
{
public:
	class AFortAthenaMutator_Ashton*             AshtonMutatorRef;                                  // 0x308(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_162[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAshtonWidgetBase* GetDefaultObj();

	void UpdateAllUI(bool bFirstUpdate);
	void OnVillainRespawnsRemainingChanged();
	void OnVillainRespawnCountChanged(int32 NumRespawnsLeft, float RespawnPercentLeft);
	void OnStoneListChanged();
	void OnStoneChanged(enum class EAshtonStoneType StoneType, enum class EAshtonStoneStateType StoneState);
	void OnOpenWidget();
	void OnCloseWidget();
};

// 0x20 (0x48 - 0x28)
// Class FortniteUI.AthenaAccoladeWrapper
class UAthenaAccoladeWrapper : public UObject
{
public:
	struct FAthenaAccolades                      AccoladeData;                                      // 0x28(0x20)(NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaAccoladeWrapper* GetDefaultObj();

};

// 0x8 (0x278 - 0x270)
// Class FortniteUI.AthenaAccoladeListEntryWidget
class UAthenaAccoladeListEntryWidget : public UCommonUserWidget
{
public:
	uint8                                        Pad_165[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaAccoladeListEntryWidget* GetDefaultObj();

	void SetTitle(class FText& TitleText);
	void SetSource(class FText& SourceText);
	void SetIcon(class UFortAccoladeItemDefinition* ItemDef);
	void SetCount(int32 Count);
};

// 0x0 (0xA80 - 0xA80)
// Class FortniteUI.AthenaAccoladeListWidget
class UAthenaAccoladeListWidget : public UCommonListView
{
public:

	static class UClass* StaticClass();
	static class UAthenaAccoladeListWidget* GetDefaultObj();

	void PopulateWidget();
};

// 0x0 (0x30 - 0x30)
// Class FortniteUI.AthenaAccountContext
class UAthenaAccountContext : public UBlueprintContextBase
{
public:

	static class UClass* StaticClass();
	static class UAthenaAccountContext* GetDefaultObj();

	void SimulateBattleBookPurchase(int32 NumLevelsToPurchase, int32* BonusLevelsGranted, bool* bOverLimit);
	bool ShouldReplaceBattleStarsWithAlternateReward();
	bool IsAtMaxBattlePassTier();
	class FText GetCurrentSeasonNumberAsText(bool bFullText);
	int32 GetCurrentSeasonNumber();
	class UAthenaSeasonItemDefinition* GetCurrentSeasonDefinition();
	class FText GetCurrentChapterNumberAsText(bool bFullText);
	class FText GetCurrentChapterAndSeasonText();
	void GetBattleBookPurchaseLimit(int32* MaxNumLevelsPossibleToPurchase, int32* BonusLevelsGranted);
};

// 0x18 (0x348 - 0x330)
// Class FortniteUI.AthenaChatModalWrapper
class UAthenaChatModalWrapper : public UCommonActivatableWidget
{
public:
	class UFortChatContainer*                    ChatContainer_Chat;                                // 0x330(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_16B[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChatModalWrapper* GetDefaultObj();

};

// 0x20 (0x350 - 0x330)
// Class FortniteUI.AthenaActivatableChatWidget
class UAthenaActivatableChatWidget : public UCommonActivatableWidget
{
public:
	class UAthenaChatModalWrapper*               Activatable_ModalBindings;                         // 0x330(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   Button_HoldToOpen;                                 // 0x338(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataTable*                            InputActionDataTable;                              // 0x340(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_16C[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaActivatableChatWidget* GetDefaultObj();

	void FocusChat(bool bFocus);
	void BacchusFrontendFocusChat();
};

// 0x50 (0x300 - 0x2B0)
// Class FortniteUI.AthenaAerialFeedback
class UAthenaAerialFeedback : public UFortHUDElementWidget
{
public:
	struct FGameplayTagContainer                 GliderRedeployTags;                                // 0x2B0(0x20)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTag                          AirbagDeployTag;                                   // 0x2D0(0x8)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItemDefinition*                   AirbagItemDefinition;                              // 0x2D8(0x8)(Edit, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortKeybindWidget*                    KeyBind;                                           // 0x2E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_Feedback;                                     // 0x2E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_170[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaAerialFeedback* GetDefaultObj();

	void HandleSkydiveLeaderChanged(bool bEnabled, bool bLocal, class AFortPlayerState* LeaderPlayerState);
	void HandleKeybindsChanged();
	void HandleBalloonMovementChanged(bool bUsingBalloonMovement);
	void BP_HandleTextChanged();
};

// 0x18 (0x2C8 - 0x2B0)
// Class FortniteUI.AthenaAIKillsBase
class UAthenaAIKillsBase : public UFortHUDElementWidget
{
public:
	class UTextBlock*                            KillsText;                                         // 0x2B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                               KillsSource;                                       // 0x2B8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCustomKillSource;                                 // 0x2C0(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_172[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaAIKillsBase* GetDefaultObj();

	void SetKillsSourcePlayerState(class AFortPlayerStateAthena* InPlayerState);
	void SetKillsSourcePlayerController(class AFortPlayerControllerAthena* InPlayerController);
};

// 0x20 (0x2D0 - 0x2B0)
// Class FortniteUI.AthenaAvailableSquadSlotsListBase
class UAthenaAvailableSquadSlotsListBase : public UFortHUDElementWidget
{
public:
	int32                                        MaxNumberOfAvailableSquadSlots;                    // 0x2B0(0x4)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAlwaysDisplayTopEntryAsDetailed;                  // 0x2B4(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_178[0xB];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UDynamicEntryBox*                      EntryBox_AvailableSlotsList;                       // 0x2C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaPlayerViewModel*                CachedPlayerVM;                                    // 0x2C8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaAvailableSquadSlotsListBase* GetDefaultObj();

	void UpdateSquadFromMinigameOptionChange();
	void UpdateIsTeamMiniGameOnMinigameVolumeChanged(class AFortVolume* Volume);
	void UpdateIsTeamMiniGameOnGameStateChanged(class AFortMinigame* Minigame, enum class EFortMinigameState MinigameState);
	void HandleSquadMemberDisconnected(class AFortPlayerStateAthena* Player);
	void HandlePlayerUniqueIdReplicated(struct FUniqueNetIdRepl& UniqueId);
	void HandlePlayerExitVolume(class APlayerState* ClientPlayerState, class AFortVolume* Volume);
	void HandlePlayerEnterVolume(class APlayerState* ClientPlayerState, class AFortVolume* Volume);
	void HandleGameMemberChanged(uint8 InSquadId, uint8 InTeamIndex, class AFortPlayerStateAthena* ChangedPS);
};

// 0x8 (0x2B8 - 0x2B0)
// Class FortniteUI.AthenaAvailableSquadSlotsListEntryBase
class UAthenaAvailableSquadSlotsListEntryBase : public UFortHUDElementWidget
{
public:
	enum class EAvailableSquadSlotsListEntryState CurrentEntryState;                                 // 0x2B0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17E[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaAvailableSquadSlotsListEntryBase* GetDefaultObj();

	void BP_OnEntryStateUpdated(enum class EAvailableSquadSlotsListEntryState NewEntryState);
};

// 0x8 (0x250 - 0x248)
// Class FortniteUI.AthenaAwardAlertBase
class UAthenaAwardAlertBase : public UUserWidget
{
public:
	class UAthenaPlayerViewModel*                PlayerVM;                                          // 0x248(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaAwardAlertBase* GetDefaultObj();

	void SetDataSource(class UAthenaPlayerViewModel* PlayerViewModel);
	void OnAwardGranted(class UFortAwardItemDefinition* AwardDefinition);
};

// 0x8 (0x250 - 0x248)
// Class FortniteUI.AthenaBattleMapClickHandler
class UAthenaBattleMapClickHandler : public UUserWidget
{
public:
	uint8                                        Pad_180[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBattleMapClickHandler* GetDefaultObj();

	void HandleToggledBattleMapLive(class ABattleMapPawnLive* BattleMapPawn);
};

// 0x40 (0x2B0 - 0x270)
// Class FortniteUI.AthenaBattleMapNodeTooltip
class UAthenaBattleMapNodeTooltip : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                      TextBlock_NodeTitle;                               // 0x270(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      TextBlock_NodeDescription;                         // 0x278(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      TextBlock_NodeTime;                                // 0x280(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                               Widget_Selection;                                  // 0x288(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                               Widget_Scrubbing;                                  // 0x290(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                               Widget_ScrubbingGamepad;                           // 0x298(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_184[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBattleMapNodeTooltip* GetDefaultObj();

	void OnReplayLevelStreamingChanged(bool bStreaming);
	void HandleUnhoveredNode(class ABattleMapNode* Node, enum class EBattleMapHoveredReason Reason);
	void HandleToggledBattleMapLive(class ABattleMapPawnLive* BattleMapPawn);
	void HandleTimelineModeChanged(bool bEnabled);
	void HandleInputMethodChanged(enum class ECommonInputType NewInputType);
	void HandleHoveredNode(class ABattleMapNode* Node, enum class EBattleMapHoveredReason Reason);
	void HandleCameraTypeChanged(class AFortPlayerControllerSpectating* SpectatorPC, enum class ESpectatorCameraType NewCameraType);
};

// 0xC0 (0x560 - 0x4A0)
// Class FortniteUI.AthenaBattleMapTimelineWidget
class UAthenaBattleMapTimelineWidget : public UFortActivatablePanel
{
public:
	class UCommonButtonLegacy*                   Button_Forward;                                    // 0x4A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   Button_Backward;                                   // 0x4A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        ForwardButtonPositionAlpha;                        // 0x4B0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        BackwardButtonPositionAlpha;                       // 0x4B4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ForwardDataTableRow;                               // 0x4B8(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   BackwardDataTableRow;                              // 0x4C8(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   StopDataTableRow;                                  // 0x4D8(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ScrubToDataTableRow;                               // 0x4E8(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ExitBattleMapDataTableRow;                         // 0x4F8(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ZoomInDataTableRow;                                // 0x508(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ZoomOutDataTableRow;                               // 0x518(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_190[0x38];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBattleMapTimelineWidget* GetDefaultObj();

	void OnReplayLevelStreamingChanged(bool bStreaming);
	void HandleZoomOutPressed(bool* bPassThrough);
	void HandleZoomOutHeld(float HeldPercent);
	void HandleZoomInPressed(bool* bPassThrough);
	void HandleZoomInHeld(float HeldPercent);
	void HandleToggledBattleMapLive(class ABattleMapPawnLive* BattleMapPawn);
	void HandleTimelineStopPressed(bool* bPassThrough);
	void HandleTimelineScrubToPressed(bool* bPassThrough);
	void HandleTimelineModeChanged(bool bEnabled);
	void HandleTimelineForwardPressed(bool* bPassThrough);
	void HandleTimelineBackwardPressed(bool* bPassThrough);
	void HandleSelectedNode(class ABattleMapNode* InSelectedNode);
	void HandleExitBattleMapPressed(bool* bPassThrough);
	void HandleCameraTypeChanged(class AFortPlayerControllerSpectating* SpectatorPC, enum class ESpectatorCameraType NewCameraType);
};

// 0x10 (0x280 - 0x270)
// Class FortniteUI.AthenaBattlePassItemTracker
class UAthenaBattlePassItemTracker : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                      Text_Category;                                     // 0x270(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonNumericTextBlock*               Text_Counter;                                      // 0x278(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaBattlePassItemTracker* GetDefaultObj();

	void OnInterpStarted();
	void OnInterpEnded(class UCommonNumericTextBlock* NumericTextBlock, bool HadCompleted);
};

// 0x100 (0x370 - 0x270)
// Class FortniteUI.AthenaBattlePassTracker
class UAthenaBattlePassTracker : public UCommonUserWidget
{
public:
	uint8                                        Pad_192[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UAthenaPassPurchaseScreen> PassPurchaseScreenClass;                           // 0x278(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                  OutfitsText;                                       // 0x280(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                  VBucksText;                                        // 0x298(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                  EmotesText;                                        // 0x2B0(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                  MoreRewardsText;                                   // 0x2C8(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                  BuyBattlePassTextFormat;                           // 0x2E0(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_193[0x40];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaPassPurchaseScreen*             PushedPurchaseScreen;                              // 0x338(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_PaidItemsCollected;                       // 0x340(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaBattlePassItemTracker*          BattlePassItemTracker_01;                          // 0x348(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaBattlePassItemTracker*          BattlePassItemTracker_02;                          // 0x350(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaBattlePassItemTracker*          BattlePassItemTracker_03;                          // 0x358(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaBattlePassItemTracker*          BattlePassItemTracker_04;                          // 0x360(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBattlePassScreenPurchaseButton*       Button_PurchaseBattlePass;                         // 0x368(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaBattlePassTracker* GetDefaultObj();

	void HandlePassPurchaseFlowComplete(bool bClosePresentationScreen);
};

// 0x28 (0x2D8 - 0x2B0)
// Class FortniteUI.AthenaBroadcastFollowedPlayerInfoBase
class UAthenaBroadcastFollowedPlayerInfoBase : public UFortHUDElementWidget
{
public:
	class UAthenaSpectatorPlayerWidgetBase*      PlayerWidget;                                      // 0x2B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaSpectatorHitPointBarBase*       HitPointBar_Health;                                // 0x2B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaSpectatorHitPointBarBase*       HitPointBar_Shield;                                // 0x2C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaSpectatorHitPointBarBase*       HitPointBar_Vehicle;                               // 0x2C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_199[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBroadcastFollowedPlayerInfoBase* GetDefaultObj();

	void OnVehicleStateChanged(class AActor* NewVehicle, class AActor* OldVehicle);
	void OnPipModeChanged(bool bPipModeEnabled);
	void OnFollowedPlayerChanged(class AFortPlayerControllerSpectating* SpectatingPC, class AFortPlayerState* FollowedPlayerState);
	void OnEliminatedStateChanged(class UAthenaRemotePlayerViewData* PlayerData, bool bIsEliminated);
};

// 0x20 (0x2D0 - 0x2B0)
// Class FortniteUI.AthenaGamePhaseWidgetBase
class UAthenaGamePhaseWidgetBase : public UFortHUDElementWidget
{
public:
	class UMaterialInterface*                    StormComingFontMaterial;                           // 0x2B0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        StormComingWarningTime;                            // 0x2B8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1A4[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UTextBlock*                            TimeText;                                          // 0x2C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1A5[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaGamePhaseWidgetBase* GetDefaultObj();

	void OnGameStateSet(class AFortGameState* InGameState);
	void OnGamePhaseStepChanged(enum class EAthenaGamePhaseStep GamePhaseStep);
	void HandleGamePhaseStepChanged(TScriptInterface<class IFortSafeZoneInterface>& SafeZoneInterface, enum class EAthenaGamePhaseStep GamePhaseStep);
	void HandleCountdownUpdate(int32 TimeRemaining);
};

// 0x8 (0x2D8 - 0x2D0)
// Class FortniteUI.AthenaBroadcastGamePhaseWidget
class UAthenaBroadcastGamePhaseWidget : public UAthenaGamePhaseWidgetBase
{
public:
	class AFortMinigame*                         MinigameOverride;                                  // 0x2D0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaBroadcastGamePhaseWidget* GetDefaultObj();

	void SetMinigameOverride(class AFortMinigame* Minigame);
};

// 0x18 (0x348 - 0x330)
// Class FortniteUI.FortUIStateWidgetBase
class UFortUIStateWidgetBase : public UCommonActivatableWidget
{
public:
	uint8                                        Pad_1A6[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonActivatableWidgetStack*         WidgetStack_PrimaryContent;                        // 0x340(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortUIStateWidgetBase* GetDefaultObj();

};

// 0x170 (0x4B8 - 0x348)
// Class FortniteUI.AthenaHUDBase
class UAthenaHUDBase : public UFortUIStateWidgetBase
{
public:
	uint8                                        Pad_1D2[0x30];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UUserWidget*>                   MinigameWidgets;                                   // 0x378(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UFortWeaponReticleExtensionData*> WeaponReticleExtensionDatas;                       // 0x388(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class AFortVolume*                           CreativeLinkedVolume;                              // 0x398(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UUserWidget>               KairosHUDLayerClass;                               // 0x3A0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FMutatorAddedWidgets>          MutatorAddedWidgets;                               // 0x3A8(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_1D3[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortWeaponReticleExtensionWidgetBase* CurrentCustomReticleExtension;                     // 0x3D0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UFortWeaponReticleExtensionWidgetBase*> RecentReticleExtensions;                           // 0x3D8(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UAthenaMapScreenContainer*             MapScreenContainer;                                // 0x3E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaHUDMenu*                        AthenaHUDMenu;                                     // 0x3F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaSkydivingInformation*           SkydivingInfoWidget;                               // 0x3F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                       CompassSwitcher;                                   // 0x400(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInZoneTitleBarBase*                   InZoneTitleBar;                                    // 0x408(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                       WidgetSwitcher_TopMid;                             // 0x410(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FUIExtension>                  TournamentUIExtensions;                            // 0x418(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<struct FUIExtension>                  ArenaTournamentUIExtensions;                       // 0x428(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UDynamicUIScene*                       PreloadMenuScene;                                  // 0x438(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UCommonActivatableWidget> NewEmotePicker;                                    // 0x440(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UCommonActivatableWidget> SquadComsPickerClass;                              // 0x468(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UFortWeaponWheel>        WeaponWheelClass;                                  // 0x490(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaHUDBase* GetDefaultObj();

	void UpdateUIExtensions(class AFortPlayerState* ClientState, class AFortMinigame* Minigame);
	void UpdateCreativePlotLinkedVolume(class AFortVolume* Volume);
	void SetZoneCompleted(bool bValue);
	void SetQuickBarNative(bool bShouldDoQuickBarNative);
	void ReleaseMenu();
	void PrepareToShowEndGameUI();
	void PreloadMenu();
	void PlaylistExtensionWidgetCreatedNotSupported(enum class EUIExtensionSlot ExtensionSlot, class UUserWidget* Widget);
	void OnVolumeShowPublishWatermarkChanged(class AActor* Volume, bool bShowPublishWatermark);
	void OnMinigamePlayModeChanged(class AFortMinigame* Minigame, bool bIsInPlayMode);
	void OnMinigameHideHUD(bool bLoading);
	void OnHUDScaleChanged(float HUDScale);
	void OnGamePhaseChanged(enum class EAthenaGamePhase NewPhase);
	void OnExtensionWidgetRemoved(enum class EUIExtensionSlot ExtensionSlot, class UUserWidget* Widget);
	void OnExtensionWidgetCreated(enum class EUIExtensionSlot ExtensionSlot, class UUserWidget* Widget);
	void OnDisplayGameOver();
	bool HUDOwnsExtensionSlot(enum class EUIExtensionSlot ExtensionSlot);
	void HandleWeaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void HandleVolumeUnloaded(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleVolumeLoaded(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleUpdateMinigameUIExtensions(class AFortMinigame* Minigame);
	void HandleSpatialLoadingStateChanged(enum class ESpatialLoadingState NewState, class AFortVolume* Volume);
	void HandlePickerOpenRequest(enum class EFortPickerMode Mode, int32 InitialOption, bool bIgnoreFirstAccept);
	void HandleOnUpdateInZoneTitleBarVisibility(bool bNewVisibility);
	void HandleOnMutatorRemoved(class AFortGameplayMutator* NewMutator);
	void HandleOnMutatorAdded(class AFortGameplayMutator* NewMutator);
	void HandleNewPanelFromMutator(TSubclassOf<class UUserWidget> PanelClass);
	void HandleLocalPlayerDied(struct FFortPlayerDeathReport& DeathReport);
	void HandleExitVolume(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleEnteredVolume(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleCursorModeChanging(bool bCursorModeEnabled, class FName ActionName);
	void HandleCursorModeChanged(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CustomWidget);
	bool GetZoneCompleted();
	void ClearUIExtensions();
	void BindVolumeEvents();
};

// 0x178 (0x630 - 0x4B8)
// Class FortniteUI.AthenaBroadcastHUDBase
class UAthenaBroadcastHUDBase : public UAthenaHUDBase
{
public:
	struct FDataTableRowHandle                   ToggleMatchStatusActionRowHandle;                  // 0x4B8(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleSquadStatusActionRowHandle;                  // 0x4C8(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleRemainingPlayersActionRowHandle;             // 0x4D8(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleActiveGridScreenActionRowHandle;             // 0x4E8(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleEliminatedGridScreenActionRowHandle;         // 0x4F8(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleMatchStatusScreenActionRowHandle;            // 0x508(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleScoreboardScreenActionRowHandle;             // 0x518(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleKillFeedActionRowHandle;                     // 0x528(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleActionFeedScreenActionRowHandle;             // 0x538(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleGotoTimeRowHandle;                           // 0x548(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   TogglePipModeActionRowHandle;                      // 0x558(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleFollowedPlayerInfoActionRowHandle;           // 0x568(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleFullscreenMapActionRowHandle;                // 0x578(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	TMap<TSoftClassPtr<class UUserWidget>, struct FUIExtension> ExtensionWidgetOverrides;                          // 0x588(0x50)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UAthenaSpectatorHUDControlsBase*       BroadcastHUDControls;                              // 0x5D8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaSpectatorNameplateLayerBase*    NameplateLayer;                                    // 0x5E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaBroadcastMapPanelBase*          AthenaBroadcastMapPanel;                           // 0x5E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonWidgetSwitcherLegacy*           EventMatchInfoSwitcher;                            // 0x5F0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonWidgetSwitcherLegacy*           Switcher_TopLeft;                                  // 0x5F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USpacer*                               TopLeft_Empty;                                     // 0x600(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBroadcastViewSettings*            TopLeft_ViewSettings;                              // 0x608(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaReplayActionFeedScreenBase*     TopLeft_ActionFeed;                                // 0x610(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortReplayGoToTimeDialogue*           TopLeft_GoToTime;                                  // 0x618(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortReplayHighlightsWindow*           TopLeft_Highlights;                                // 0x620(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1F0[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBroadcastHUDBase* GetDefaultObj();

	void TryHandleIfPlayerStateAlreadyInVolume();
	void SetFullscreenMapVisibility(bool bIsVisible);
	void OnVolumeMinigameChanged(class AFortMinigame* Minigame);
	void OnVolumeEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnVolumeBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	void OnVolumeAdded(class AFortVolume* Volume);
	void OnUnableToPerformAction(const struct FGameplayTagContainer& FailedReason, class FText& FailureText);
	void OnToggleSquadStatusActionExecuted(bool* bPassThrough);
	void OnToggleScoreboardScreenActionExecuted(bool* bPassThrough);
	void OnToggleRemainingPlayersActionExecuted(bool* bPassThrough);
	void OnTogglePipModeActionExecuted(bool* bPassThrough);
	void OnToggleMatchStatusScreenActionExecuted(bool* bPassThrough);
	void OnToggleMatchStatusActionExecuted(bool* bPassThrough);
	void OnToggleKillFeedActionExecuted(bool* bPassThrough);
	void OnToggleFollowedPlayerInfoActionExecuted(bool* bPassThrough);
	void OnToggleEliminatedGridScreenActionExecuted(bool* bPassThrough);
	void OnToggleActiveGridScreenActionExecuted(bool* bPassThrough);
	void OnPlaylistDataChanged(class UFortPlaylistAthena* PlaylistData);
	void OnPlayerTargetingChanged(bool bIsTargeting);
	void OnPipModeChanged(bool bEnabled);
	void OnMinigameChanged(class AFortMinigame* NewMinigame);
	void OnIndicatorModeChanged(bool bIndicatorsEnabled);
	void OnHudVisibilityChanged(enum class EHudVisibilityState NewVisibility);
	void OnGameStateSet_BP(class AFortGameStateAthena* GameStateAthena);
	void OnGameStateSet(class AFortGameState* NewGameState);
	void OnCursorModeChanging(bool bCursorModeEnabled, class FName ActionName);
	void OnCurrentPlaylistChanged();
	void HandleToggleReplayViewSettings();
	void HandleToggleHighlightsList();
	void HandleToggleGoToTime();
	void HandleToggleActionFeedScreen();
	void HandleSpectatorViewTargetChanged();
	void HandleNameplatesEnabledChanged(bool bInNameplatesEnabled);
	void HandleHudVisibilityChanged(enum class EHudVisibilityState NewVisibility);
	void HandleFollowedPlayerRespawnTimeChanged(float RespawnTime);
};

// 0x8 (0x2F0 - 0x2E8)
// Class FortniteUI.AthenaBroadcastHUDMenuStatusBase
class UAthenaBroadcastHUDMenuStatusBase : public UFortActorIndicatorWidget
{
public:
	float                                        ZOffset;                                           // 0x2E8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1F3[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBroadcastHUDMenuStatusBase* GetDefaultObj();

	void MapActivated();
	void InventoryActivated();
};

// 0x10 (0x2C0 - 0x2B0)
// Class FortniteUI.AthenaBroadcastHUDMenuStatusLayerBase
class UAthenaBroadcastHUDMenuStatusLayerBase : public UFortHUDElementWidget
{
public:
	TSubclassOf<class UAthenaBroadcastHUDMenuStatusBase> HUDMenuStatusWidgetClass;                          // 0x2B0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1F4[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBroadcastHUDMenuStatusLayerBase* GetDefaultObj();

	void RemoveHUDMenuStatus(class UAthenaBroadcastHUDMenuStatusBase* HUDMenuStatusWidget);
	void DeactivateHudMenuWidget();
	void AddHUDMenuStatus(class UAthenaBroadcastHUDMenuStatusBase* HUDMenuStatusWidget);
};

// 0x20 (0x2D0 - 0x2B0)
// Class FortniteUI.AthenaBroadcastKillFeedBase
class UAthenaBroadcastKillFeedBase : public UFortHUDElementWidget
{
public:
	class UFortDynamicEntryBox*                  KillFeedEntryBox;                                  // 0x2B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TimeToShowEntry;                                   // 0x2B8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1F6[0x14];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBroadcastKillFeedBase* GetDefaultObj();

	void OnToggleShowKillFeed(bool bShowKillFeed);
	void OnTimelineScrubbed();
	void AddKillFeedEntry(struct FAthenaBroadcastKillFeedEntryInfo& KillFeedEntryInfo);
};

// 0xE8 (0x398 - 0x2B0)
// Class FortniteUI.AthenaBroadcastKillFeedItemBase
class UAthenaBroadcastKillFeedItemBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_1F8[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UMaterialInterface>     EliminationIcon;                                   // 0x2B8(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialInterface>     StormIcon;                                         // 0x2E0(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialInterface>     FallDamageIcon;                                    // 0x308(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialInterface>     ExplosionIcon;                                     // 0x330(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialInterface>     DbnoIcon;                                          // 0x358(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_InstigatorName;                               // 0x380(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_VictimName;                                   // 0x388(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_EntryIcon;                                   // 0x390(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaBroadcastKillFeedItemBase* GetDefaultObj();

};

// 0x40 (0x4E0 - 0x4A0)
// Class FortniteUI.AthenaBroadcastMapPanelBase
class UAthenaBroadcastMapPanelBase : public UFortActivatablePanel
{
public:
	class UAthenaSpectatorMapPlayerListBase*     PlayerList;                                        // 0x4A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaMapLayer*                       AthenaMapLayer;                                    // 0x4A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonWidgetSwitcherLegacy*           LhsSwitcher;                                       // 0x4B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   Button_CycleSideBar;                               // 0x4B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   CycleSideBarRowHandle;                             // 0x4C0(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortBroadcasterMapSettings> MapSettingsClass;                                  // 0x4D0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1F9[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBroadcastMapPanelBase* GetDefaultObj();

};

// 0x8 (0x2B8 - 0x2B0)
// Class FortniteUI.AthenaBroadcastMatchStatusWidget
class UAthenaBroadcastMatchStatusWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_1FA[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBroadcastMatchStatusWidget* GetDefaultObj();

	void OnStormPhaseChanged(int32 StormPhase);
};

// 0x10 (0x2C0 - 0x2B0)
// Class FortniteUI.AthenaBroadcastPlayerEventScoreWidget
class UAthenaBroadcastPlayerEventScoreWidget : public UFortHUDElementWidget
{
public:
	class UCommonTextBlock*                      PlayerEventScoreText;                              // 0x2B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonWidgetSwitcherLegacy*           PlayerEventScoreSwitcher;                          // 0x2B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaBroadcastPlayerEventScoreWidget* GetDefaultObj();

	void OnRemoteClientEventScoreChanged(int32 NewEventScore);
	void OnPointTextSet();
};

// 0x8 (0x2B8 - 0x2B0)
// Class FortniteUI.AthenaBroadcastPlayerLocationWidget
class UAthenaBroadcastPlayerLocationWidget : public UFortHUDElementWidget
{
public:
	class UCommonTextBlock*                      PlayerLocationText;                                // 0x2B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaBroadcastPlayerLocationWidget* GetDefaultObj();

	void OnRemoteClientPoiTagIDChanged(int16 RemoteClientPoiTagID);
};

// 0x8 (0x2B8 - 0x2B0)
// Class FortniteUI.AthenaBroadcastSessionId
class UAthenaBroadcastSessionId : public UFortHUDElementWidget
{
public:
	class UTextBlock*                            Text_SessionId;                                    // 0x2B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaBroadcastSessionId* GetDefaultObj();

};

// 0x8 (0x2B8 - 0x2B0)
// Class FortniteUI.AthenaEventMatchSquadWidgetBase
class UAthenaEventMatchSquadWidgetBase : public UFortHUDElementWidget
{
public:
	TWeakObjectPtr<class UAthenaRemoteSquadViewData> SquadData;                                         // 0x2B0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaEventMatchSquadWidgetBase* GetDefaultObj();

	void SetSquadIdVisible(bool bSquadIdVisible);
	void OnSquadSessionRankChanged(class UAthenaRemoteSquadViewData* InSquadData, int32 InSquadSessionRank);
	void OnSquadPlaceChanged(class UAthenaRemoteSquadViewData* InSquadData, int32 InSquadPlace);
	void OnSquadKillscoreChanged(class UAthenaRemoteSquadViewData* InSquadData, int32 InSquadKills);
	void OnSquadIdChanged(class UAthenaRemoteSquadViewData* InSquadData, uint8 InSquadId);
	void OnSquadColorChanged(class UAthenaRemoteSquadViewData* InSquadData, const struct FLinearColor& InSquadColor);
	void OnPlayerAdded(class UAthenaRemoteSquadViewData* InSquadData, class UAthenaRemotePlayerViewData* InPlayerData);
	void HandleDisplaySessionRankChanged(bool bDisplay);
};

// 0x28 (0x2E0 - 0x2B8)
// Class FortniteUI.AthenaBroadcastSquadStatusWidget
class UAthenaBroadcastSquadStatusWidget : public UAthenaEventMatchSquadWidgetBase
{
public:
	struct FUniqueNetIdRepl                      FollowedPlayerUID;                                 // 0x2B8(0x28)(BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaBroadcastSquadStatusWidget* GetDefaultObj();

	void OnPipModeChanged(bool bPipModeEnabled);
	void OnMinigameTeamIdChanged(class UFortMinigameTeamIdentification* MinigameTeamId);
	void OnFollowedPlayerChanged();
	void HandleSquadIdChanged(class UAthenaRemoteSquadViewData* InSquadData, uint8 SquadId);
	void HandleFollowedPlayerChanged(class AFortPlayerControllerSpectating* SpectatorController, class AFortPlayerState* NewFollowedPlayer);
};

// 0x98 (0x500 - 0x468)
// Class FortniteUI.AthenaCareerScreen
class UAthenaCareerScreen : public UCommonActivatablePanelLegacy
{
public:
	TSoftClassPtr<class UAthenaLeaderboardScreenBase> LeaderboardsScreenClass;                           // 0x468(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UAthenaReplayBrowserScreenBase> ReplayBrowserScreenClass;                          // 0x490(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   BackToSocialTabInputActionRowHandle;               // 0x4B8(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_AccountLevel;                                 // 0x4C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   Button_Leaderboards;                               // 0x4D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   Button_Replays;                                    // 0x4D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaFeatTimelineListView*           ListView_FeatTimeline;                             // 0x4E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ChapterContext;                               // 0x4E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBacchusCloseButton*                   Mobile_CloseButton;                                // 0x4F0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_MobileTabLabel;                               // 0x4F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCareerScreen* GetDefaultObj();

	void ShowFeats(bool bHasCompletedFeats);
};

// 0x120 (0x368 - 0x248)
// Class FortniteUI.AthenaChallengeCountdownDisplay
class UAthenaChallengeCountdownDisplay : public UUserWidget
{
public:
	uint8                                        Pad_20C[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDateTime                             UnlockTime;                                        // 0x258(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class ECountdownDisplay                 DisplayType;                                       // 0x260(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_20D[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimerDisplayData                     DisplayData[0x4];                                  // 0x268(0xE0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                        Pad_20E[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_TimeRemaining;                                // 0x360(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeCountdownDisplay* GetDefaultObj();

	void OnChallengeSet(struct FTimerDisplayData& DisplayStyle);
};

// 0x0 (0x350 - 0x350)
// Class FortniteUI.AthenaChallengeDateTimeTextBlock
class UAthenaChallengeDateTimeTextBlock : public UCommonDateTimeTextBlock
{
public:

	static class UClass* StaticClass();
	static class UAthenaChallengeDateTimeTextBlock* GetDefaultObj();

};

// 0x10 (0x280 - 0x270)
// Class FortniteUI.AthenaChallengeDetailBase
class UAthenaChallengeDetailBase : public UCommonUserWidget
{
public:
	class UFortItemBaseWidget*                   ItemInfo_PreviewedItem;                            // 0x270(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USizeBox*                              SB_MainContent;                                    // 0x278(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaChallengeDetailBase* GetDefaultObj();

};

// 0x198 (0x1C8 - 0x30)
// Class FortniteUI.AthenaChallengeDisplayData
class UAthenaChallengeDisplayData : public UDataAsset
{
public:
	int32                                        SoonDisplayMinuteThreshold;                        // 0x30(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          PartyAssistFontColor;                              // 0x34(0x10)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          DifficultChallengeFontColor;                       // 0x44(0x10)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_211[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            PartyAssistIcon;                                   // 0x58(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                            ExternalPartyAssistIcon;                           // 0x60(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortChallengeSetStyle                DefaultChallengeStyle;                             // 0x68(0xA0)(Edit, NativeAccessSpecifierPublic)
	struct FFortChallengeSetStyle                DailyChallengeStyle;                               // 0x108(0xA0)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FGameplayTagContainer>         PunchCardSortOrder;                                // 0x1A8(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FFortChallengePunchCardStyles> ChallengePunchCardStyles;                          // 0x1B8(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaChallengeDisplayData* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.AthenaChallengeDisplayLibrary
class UAthenaChallengeDisplayLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UAthenaChallengeDisplayLibrary* GetDefaultObj();

	struct FLinearColor GetChallengeStyleLightAccentColor(struct FFortChallengeSetStyle& DisplayStyle);
	void ApplyChallengeSetStyleColorsToMaterial(struct FFortChallengeSetStyle& DisplayStyle, class UMaterialInstanceDynamic* StyleMaterial);
	void ApplyChallengeSetStyleColorsToImageMaterial(struct FFortChallengeSetStyle& DisplayStyle, class UImage* ImageWidget);
};

// 0x8 (0x278 - 0x270)
// Class FortniteUI.AthenaChallengeListEntryBase
class UAthenaChallengeListEntryBase : public UCommonUserWidget
{
public:
	uint8                                        Pad_21A[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntryBase* GetDefaultObj();

	void StartHighlight();
	void EndHighlight();
	void BP_OnChallengeInfoSet(bool bDisabled);
};

// 0x308 (0x580 - 0x278)
// Class FortniteUI.AthenaChallengeEmptyQuest
class UAthenaChallengeEmptyQuest : public UAthenaChallengeListEntryBase
{
public:
	class URichTextBlock*                        RichTextBlock_DisplayText;                         // 0x278(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                  TextDefaultDescription;                            // 0x280(0x18)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                        Pad_220[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTextBlockStyle                       TextBlockStyleDefault;                             // 0x2A0(0x2E0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeEmptyQuest* GetDefaultObj();

};

// 0x0 (0x278 - 0x278)
// Class FortniteUI.AthenaChallengeListEntry_PartyUp
class UAthenaChallengeListEntry_PartyUp : public UAthenaChallengeListEntryBase
{
public:

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntry_PartyUp* GetDefaultObj();

	void HandleTransientQuestStarted(class UFortQuestItem* QuestItem, class UFortQuestItemDefinition* PreceedingQuestDef);
	void HandleTransientQuestRemoved(class UFortQuestItem* QuestItem);
};

// 0x10 (0x288 - 0x278)
// Class FortniteUI.AthenaChallengeListEntry_MoreQuestsTimer
class UAthenaChallengeListEntry_MoreQuestsTimer : public UAthenaChallengeListEntryBase
{
public:
	class UAthenaChallengeDateTimeTextBlock*     DateTimeText_TimeUntilMoreQuests;                  // 0x278(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_224[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntry_MoreQuestsTimer* GetDefaultObj();

	struct FTimespan GetStartingCountdownTime();
	void BP_InitCountdown(struct FTimespan& InStartTime, struct FGameplayTag& ChallengeCategory);
};

// 0x0 (0x278 - 0x278)
// Class FortniteUI.AthenaChallengeListEntry_AllQuestsComplete
class UAthenaChallengeListEntry_AllQuestsComplete : public UAthenaChallengeListEntryBase
{
public:

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntry_AllQuestsComplete* GetDefaultObj();

};

// 0x8 (0x250 - 0x248)
// Class FortniteUI.AthenaChallengeEntry
class UAthenaChallengeEntry : public UUserWidget
{
public:
	class UCommonRichTextBlock*                  Text_CurrentTask;                                  // 0x248(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaChallengeEntry* GetDefaultObj();

};

// 0x18 (0x40 - 0x28)
// Class FortniteUI.ImageGridObject
class UImageGridObject : public UObject
{
public:
	int32                                        GridLocation;                                      // 0x28(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_226[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortChallengeBundleItemDefinition*    BundleData;                                        // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortQuestItem*                        QuestItem;                                         // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UImageGridObject* GetDefaultObj();

};

// 0x48 (0xF40 - 0xEF8)
// Class FortniteUI.AthenaChallengeImageGridEntry
class UAthenaChallengeImageGridEntry : public UCommonButtonLegacy
{
public:
	uint8                                        Pad_229[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonLazyImage*                      Image_Brush;                                       // 0xF10(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bSelected;                                         // 0xF18(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_22B[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        GridLocation;                                      // 0xF1C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        Column;                                            // 0xF20(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        Row;                                               // 0xF24(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_22D[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeImageGridEntry* GetDefaultObj();

	void TransitionFromOwnedToCompletedState();
	void TransitionFromLockedToOwnedState();
	void SetupLockedToOwnState();
	void OnChallengeSet(bool bIsComplete, bool bIsLocked);
};

// 0x8 (0x250 - 0x248)
// Class FortniteUI.AthenaChallengeInviteFriendPrompt
class UAthenaChallengeInviteFriendPrompt : public UUserWidget
{
public:
	class URichTextBlock*                        RichText_InviteFriendMessage;                      // 0x248(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeInviteFriendPrompt* GetDefaultObj();

};

// 0x10 (0x258 - 0x248)
// Class FortniteUI.AthenaChallengeRewardDisplayEntry
class UAthenaChallengeRewardDisplayEntry : public UUserWidget
{
public:
	class UFortLazyImage*                        LazyImage_RewardIcon;                              // 0x248(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCommonTextBlock*                      Text_RewardQuantity;                               // 0x250(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaChallengeRewardDisplayEntry* GetDefaultObj();

};

// 0x10 (0x258 - 0x248)
// Class FortniteUI.AthenaChallengeRewardDisplay
class UAthenaChallengeRewardDisplay : public UUserWidget
{
public:
	class UDynamicEntryBox*                      EntryBox_Rewards;                                  // 0x248(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_CompletionIcon;                              // 0x250(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeRewardDisplay* GetDefaultObj();

};

// 0x28 (0x2A0 - 0x278)
// Class FortniteUI.AthenaChallengeTreeEntry_ChallengeSet
class UAthenaChallengeTreeEntry_ChallengeSet : public UAthenaChallengeListEntryBase
{
public:
	uint8                                        Pad_235[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_ChallengeSetName;                             // 0x288(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ChallengeSetContext;                          // 0x290(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_PercentComplete;                              // 0x298(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeTreeEntry_ChallengeSet* GetDefaultObj();

	void OnChallengeSetEstablished(struct FFortChallengeSetStyle& DisplayStyle);
};

// 0x28 (0x2A0 - 0x278)
// Class FortniteUI.AthenaChallengeListEntry_Challenge
class UAthenaChallengeListEntry_Challenge : public UAthenaChallengeListEntryBase
{
public:
	uint8                                        Pad_23A[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bHideProgressBar;                                  // 0x288(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_23B[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonRichTextBlock*                  RichText_ChallengeDesc;                            // 0x290(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeProgressBar*           ChallengeProgress_ObjectivesCompleted;             // 0x298(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntry_Challenge* GetDefaultObj();

	void OnPartyAssistEnabledChanged(bool bIsPartyAssistEnabled);
	void OnChallengeInfoSet(bool bIsComplete, bool bIsLocked, bool bIsGroupChallenge, bool bCompact, bool HideRewards);
	int32 GetChallengeWeight();
	void BP_HandleIsTrackedChallengeChanged(bool bIsTrackedChallenge);
};

// 0x68 (0x308 - 0x2A0)
// Class FortniteUI.AthenaChallengeListEntry_DetailedChallenge
class UAthenaChallengeListEntry_DetailedChallenge : public UAthenaChallengeListEntry_Challenge
{
public:
	uint8                                        Pad_23E[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bHasAnyOptionsAvailable;                           // 0x2B0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsDisplayingChallengeActions;                     // 0x2B1(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_240[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   BackAction;                                        // 0x2B8(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   CloseChallengeOptionsAction;                       // 0x2C8(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                      BoundAnim_ShowChallengeOptions;                    // 0x2D8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UButton*                               SimpleButton_TopClickArea;                         // 0x2E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeRewardDisplay*         Reward_QuestReward;                                // 0x2E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   Button_PartyAssist;                                // 0x2F0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   Button_ReplaceChallenge;                           // 0x2F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_ActionInfo;                               // 0x300(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntry_DetailedChallenge* GetDefaultObj();

	void HandleUpperAreaClicked();
	void HandleCloseChallengeOptionsInputAction(bool* bPassThrough);
};

// 0x8 (0x280 - 0x278)
// Class FortniteUI.AthenaChallengeListEntry_Header
class UAthenaChallengeListEntry_Header : public UAthenaChallengeListEntryBase
{
public:
	class UCommonTextBlock*                      Text_SectionTitle;                                 // 0x278(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntry_Header* GetDefaultObj();

	void OnSectionTypeSet(enum class EChallengeListSection SectionType);
};

// 0x18 (0x290 - 0x278)
// Class FortniteUI.AthenaChallengeListEntry_CompletionReward
class UAthenaChallengeListEntry_CompletionReward : public UAthenaChallengeListEntryBase
{
public:
	class UAthenaChallengeRewardDisplay*         Reward_CompletionReward;                           // 0x278(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_Description;                              // 0x280(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeProgressBar*           ChallengeProgress_ObjectivesCompleted;             // 0x288(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntry_CompletionReward* GetDefaultObj();

	void OnRewardInfoSet(bool bIsCompleted, struct FFortChallengeSetStyle& DisplayStyle);
};

// 0x48 (0x2C0 - 0x278)
// Class FortniteUI.AthenaChallengeListEntry_StoreOffer
class UAthenaChallengeListEntry_StoreOffer : public UAthenaChallengeListEntryBase
{
public:
	TSoftClassPtr<class UFortStoreFrontOfferDetailsWidgetBase> OfferDetailsWidgetClass;                           // 0x278(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortStoreFrontOfferInfo*              OfferInfo;                                         // 0x2A0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UButton*                               SimpleButton_ClickArea;                            // 0x2A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_Description;                              // 0x2B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                        LazyImage_SpecialOffer;                            // 0x2B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntry_StoreOffer* GetDefaultObj();

	void OnOfferSet();
	void HandleClicked();
};

// 0x8 (0x280 - 0x278)
// Class FortniteUI.AthenaChallengeListEntry_GoalCard
class UAthenaChallengeListEntry_GoalCard : public UAthenaChallengeListEntryBase
{
public:
	class UAthenaGoalsPageQuestCard*             GoalCard;                                          // 0x278(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntry_GoalCard* GetDefaultObj();

	void OnChallengeDataSet(bool bDisabled);
};

// 0x180 (0x3F8 - 0x278)
// Class FortniteUI.AthenaChallengeListEntry_NpcQuest
class UAthenaChallengeListEntry_NpcQuest : public UAthenaChallengeListEntryBase
{
public:
	class URichTextBlock*                        RichText_ChallengeDesc;                            // 0x278(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URichTextBlock*                        RichText_ObjectivesCompletedSelected;              // 0x280(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URichTextBlock*                        RichText_ObjectivesCompletedUnselected;            // 0x288(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                        LazyImage_SourceIcon;                              // 0x290(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URichTextBlock*                        RichText_SourceName;                               // 0x298(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URichTextBlock*                        RichText_FlavorText;                               // 0x2A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeDateTimeTextBlock*     DateTimeText_TimeRemaining;                        // 0x2A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_RemoveQuest;                                // 0x2B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortHoldableButton*                   Button_ReplaceQuest;                               // 0x2B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USizeBox*                              SizeBox_Pinned;                                    // 0x2C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeRewards*               UserWidget_Rewards;                                // 0x2C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_QuestID;                                      // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ReplaceQuest;                                 // 0x2D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USizeBox*                              SizeBox_ReplaceQuest;                              // 0x2E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USizeBox*                              SizeBox_StyleSize;                                 // 0x2E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                        LazyImage_ReplaceQuestIndicator;                   // 0x2F0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActionWidget*                   ActionWidget_ReplaceQuest;                         // 0x2F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USizeBox*                              SizeBox_PlayerLeftMatch;                           // 0x300(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                  TextConfirmRemoveQuestTitle;                       // 0x308(0x18)(Edit, NativeAccessSpecifierPrivate)
	class FText                                  TextConfirmRemoveQuestDescription;                 // 0x320(0x18)(Edit, NativeAccessSpecifierPrivate)
	class FText                                  TextReplaceQuestGamepad;                           // 0x338(0x18)(Edit, NativeAccessSpecifierPrivate)
	class FText                                  TextReplaceQuestMouse;                             // 0x350(0x18)(Edit, NativeAccessSpecifierPrivate)
	class FText                                  TextReplaceQuestTouch;                             // 0x368(0x18)(Edit, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UObject>                DefaultPortraitDisplayAsset;                       // 0x380(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_25A[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UHorizontalBox*                        HorizontalBox_DefaultWidgetsRoot;                  // 0x3C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EChallengeListEntryType           EntryType;                                         // 0x3C8(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_25C[0x2F];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntry_NpcQuest* GetDefaultObj();

	void OnSetState(bool bIsCompleted, bool bIsLocked, bool bIsPartyAssisted, bool bIsGroupChallenge);
	void OnReplaceQuestConfirmed__DelegateSignature();
	bool IsSelected();
	void HandleQuestUpdate(class UFortQuestItem* QuestItem, bool bQuestCompleted);
	void HandleQuestSeen(class UFortAccountItem* AccountItem);
	void HandlePinnedQuestsChanged();
	void BP_OnTimerSet(enum class EAthenaChallengeTimerState TimerState);
	void BP_OnSelectedForQuestReplacing(bool bSelected);
	void BP_OnRaritySet(enum class EFortRarity Rarity);
	void BP_OnChallengeSeenChanged(bool bChallengeSeen);
	void BP_FormatForChallengeOwnerLeftGame(bool bHasOwnerLeftGame);
};

// 0x28 (0x2A0 - 0x278)
// Class FortniteUI.AthenaChallengeListEntry_StagedQuest
class UAthenaChallengeListEntry_StagedQuest : public UAthenaChallengeListEntryBase
{
public:
	class URichTextBlock*                        RichTextBlock_DisplayText;                         // 0x278(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                  Text_BundleName;                                   // 0x280(0x18)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPrivate)
	int32                                        UnlockNumber;                                      // 0x298(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_25F[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntry_StagedQuest* GetDefaultObj();

	void BP_InitDisplayText();
};

// 0xF0 (0x308 - 0x218)
// Class FortniteUI.AthenaChallengeListViewBase
class UAthenaChallengeListViewBase : public UListViewBase
{
public:
	uint8                                        Pad_260[0xC0];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaQuestEntryVisualData*           VisualData;                                        // 0x2D8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_261[0x20];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        EntrySpacing;                                      // 0x300(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_262[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeListViewBase* GetDefaultObj();

};

// 0x70 (0x2B8 - 0x248)
// Class FortniteUI.AthenaChallengeNpcQuestCounter
class UAthenaChallengeNpcQuestCounter : public UUserWidget
{
public:
	struct FGameplayTagContainer                 ExcludedTabs;                                      // 0x248(0x20)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                  Text_PartyTab;                                     // 0x268(0x18)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                  Text_PersonalTab;                                  // 0x280(0x18)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_26B[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class URichTextBlock*                        RichText_HeaderDesc;                               // 0x2A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URichTextBlock*                        RichText_MaxQuests;                                // 0x2A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URichTextBlock*                        RichText_NumActiveQuests;                          // 0x2B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeNpcQuestCounter* GetDefaultObj();

	void UpdateVisibility(struct FGameplayTag& CurrentTabTag);
	void HandleTransientQuestStarted(class UFortQuestItem* QuestItem, class UFortQuestItemDefinition* PreceedingQuestDef);
	void HandleTransientQuestRemoved(class UFortQuestItem* QuestItem);
	void HandleQuestUpdate(class UFortQuestObjectiveInfo* QuestObjective, bool bDisplayStatusUpdate, bool bDisplayAnnouncementUpdate);
};

// 0x158 (0x460 - 0x308)
// Class FortniteUI.AthenaChallengeNpcQuestListView
class UAthenaChallengeNpcQuestListView : public UAthenaChallengeListViewBase
{
public:
	uint8                                        Pad_26F[0x148];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UAthenaChallengeListEntry_Header> SectionHeaderEntryClass;                           // 0x450(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UAthenaChallengeListEntry_Header> DisabledHeaderEntryClass;                          // 0x458(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeNpcQuestListView* GetDefaultObj();

};

// 0x18 (0x260 - 0x248)
// Class FortniteUI.AthenaChallengeProgressBar
class UAthenaChallengeProgressBar : public UUserWidget
{
public:
	bool                                         bHideProgressBar;                                  // 0x248(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_273[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UProgressBar*                          ProgressBar_StepsCompleted;                        // 0x250(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_Progress;                                 // 0x258(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeProgressBar* GetDefaultObj();

	void SetPercentValueForMaterialNumber(int32 PercentValue);
};

// 0x68 (0x2D8 - 0x270)
// Class FortniteUI.AthenaChallengePunchCard
class UAthenaChallengePunchCard : public UCommonUserWidget
{
public:
	int32                                        MaxPunchesAllowed;                                 // 0x270(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_27F[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UDynamicEntryBox*                      Box_PunchSlots;                                    // 0x278(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_Title;                                        // 0x280(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_Description;                                  // 0x288(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_280[0x30];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bInitializedWidgetPool;                            // 0x2C0(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bBundleIsKnown;                                    // 0x2C1(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bBangShown;                                        // 0x2C2(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_281[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TWeakObjectPtr<class UFortChallengeBundleItemDefinition> WeakBundleDef;                                     // 0x2C4(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_282[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDateTime                             MostRecentPunch;                                   // 0x2D0(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengePunchCard* GetDefaultObj();

	void UpdateChallengePunchCard(class UFortChallengeBundleItem* Bundle, class UFortQuestItem* CopmpletedQuest);
	void UnfocusPunchCard();
	void TryToClearBangState();
	void ShowWidget();
	void SetUpEncodedName(const class FString& Name, int32 Count);
	void SetUnkownState(bool bKnown);
	void SetStyle(struct FFortChallengePunchCardStyles& PunchStyle);
	void SetProgressCount(int32 AchivedCount, int32 GoalCount);
	void SetBangState(bool bShowBang);
	void HideProgressCount(bool bBundleCompleted);
	void FocusPunchCard();
	void FinishedPunchingCard(bool bPlayOutro);
};

// 0x40 (0x2B0 - 0x270)
// Class FortniteUI.AthenaChallengePunchCardEntry
class UAthenaChallengePunchCardEntry : public UCommonUserWidget
{
public:
	class FName                                  IconParamName;                                     // 0x270(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        SlotIndex;                                         // 0x278(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsBeingPlaced;                                    // 0x27C(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_286[0x1B];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_RewardQuantity;                               // 0x298(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                  Text_UnlockDate;                                   // 0x2A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortLazyImage*                        LazyImage_Stamp;                                   // 0x2A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaChallengePunchCardEntry* GetDefaultObj();

	void SetToDefaultSlot();
	void SetStyle(struct FFortChallengePunchCardStyles& PunchStyle);
	void SetIsNonsequentialSlot();
	void SetIsLastSlot();
	void SetIsFirstSlot();
	void OnPlacedEntry();
	void OnFinishedPlacingEntry();
};

// 0x60 (0x2D0 - 0x270)
// Class FortniteUI.AthenaChallengeRecapEntry
class UAthenaChallengeRecapEntry : public UCommonUserWidget
{
public:
	uint8                                        Pad_28C[0x48];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_QuestObjective;                               // 0x2B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_CompletionCount;                              // 0x2C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                       Switcher_Progression;                              // 0x2C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeRecapEntry* GetDefaultObj();

	void UpdateProgressBar(float StartingPercent, float EndingPercent);
	void StartOutroAnim();
	void StartIntroAnim();
	void OutroFinished();
	void IntroFinished();
};

// 0x40 (0x288 - 0x248)
// Class FortniteUI.AthenaChallengeRewards
class UAthenaChallengeRewards : public UUserWidget
{
public:
	class UFortLazyImage*                        LazyImage_RewardIcon;                              // 0x248(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_RewardCount;                                  // 0x250(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_RewardBacking;                               // 0x258(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortDynamicEntryBox*                  DynamicBox_MultiMarkers;                           // 0x260(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_28F[0x20];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeRewards* GetDefaultObj();

};

// 0x0 (0x248 - 0x248)
// Class FortniteUI.AthenaChallengeRewardsMultiMarker
class UAthenaChallengeRewardsMultiMarker : public UUserWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaChallengeRewardsMultiMarker* GetDefaultObj();

	void BP_OnSetMarkerActive(bool bIsActive);
};

// 0x68 (0x2D8 - 0x270)
// Class FortniteUI.AthenaChallengeRewardTrackEntry
class UAthenaChallengeRewardTrackEntry : public UCommonUserWidget
{
public:
	class FName                                  MissionRewardParamName;                            // 0x270(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortItemDefinition>    RewardToRepresent;                                 // 0x278(0x28)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        BundleRewardIndex;                                 // 0x2A0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_299[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UImage*                                Image_ConnectorLeft;                               // 0x2A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_ConnectorRight;                              // 0x2B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeRewardDisplayEntry*    MissionReward;                                     // 0x2B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_29B[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeRewardTrackEntry* GetDefaultObj();

	void StyleChange(bool bViewingPrestige);
	void SetToDefaultState();
	void SetLastNodeInTrack(bool bIsLast);
	void SetAsCurrentPreviewItem();
	void NextRewardToEarn(bool bNext);
	void CompletedNextNode(bool bAnimate);
	void CompletedCurrentNode(bool bAnimate, bool LastReward);
	void ClearPreviewSelection();
};

// 0x58 (0x360 - 0x308)
// Class FortniteUI.AthenaChallengeSetListView
class UAthenaChallengeSetListView : public UAthenaChallengeListViewBase
{
public:
	struct FAthenaChallengeListVisualOptions     ListVisualOptions;                                 // 0x308(0xC)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                         bHideHeaders;                                      // 0x314(0x1)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bHideCompletionRewards;                            // 0x315(0x1)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bHideQuestRewards;                                 // 0x316(0x1)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseCompactActionInfo;                             // 0x317(0x1)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAllowFocus;                                       // 0x318(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_29D[0x2F];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UAthenaChallengeListEntry_Header> SectionHeaderEntryClass;                           // 0x348(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UAthenaChallengeListEntry_CompletionReward> CompletionRewardEntryClass;                        // 0x350(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UAthenaChallengeListEntry_StoreOffer> SpecialOfferEntryClass;                            // 0x358(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeSetListView* GetDefaultObj();

};

// 0xA8 (0x358 - 0x2B0)
// Class FortniteUI.AthenaChallengesWidget
class UAthenaChallengesWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_2A4[0x40];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_Challenges;                                   // 0x2F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicEntryBox*                      DynamicEntryBox_ChallengeEntries;                  // 0x2F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2A5[0x50];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortPrioritizedWidgetData            PrioritizedWidgetData;                             // 0x350(0x2)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_2A6[0x6];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengesWidget* GetDefaultObj();

	void HandleDisplayDynamicQuestUpdate(class UFortQuestObjectiveInfo* QuestObjective, bool DisplayStatusUpdate, bool DisplayAnnouncementUpdate);
	void BP_WidgetIsFinished();
	void BP_OnWidgetActivated();
};

// 0x80 (0x388 - 0x308)
// Class FortniteUI.AthenaChallengeTreeView
class UAthenaChallengeTreeView : public UAthenaChallengeListViewBase
{
public:
	uint8                                        Pad_2A7[0x70];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UAthenaChallengeTreeEntry_ChallengeSet> SetHeaderEntryClass;                               // 0x378(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bReturnFocusToSelection;                           // 0x380(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2A8[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeTreeView* GetDefaultObj();

	void HandleQuestsUpdated();
};

// 0x70 (0x320 - 0x2B0)
// Class FortniteUI.AthenaCollectionItemToast
class UAthenaCollectionItemToast : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_2AF[0x28];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        OpenCollectionScreenInputHoldTime;                 // 0x2D8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2B0[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_ItemNumber;                                   // 0x2E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ItemName;                                     // 0x2E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonLazyImage*                      LazyImage_ItemImage;                               // 0x2F0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UButton*                               Button_MobileClickCatcher;                         // 0x2F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2B3[0x20];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCollectionItemToast* GetDefaultObj();

	void ResetToast();
	void HandleMobileClick();
	bool BPCallableIsDesignTime();
	void BP_OnToastUpdated(enum class EFortCollectedState CollectedState, int32 NumCollected);
	void BP_OnToastReset();
	void BP_OnDisplayToast();
};

// 0x20 (0x340 - 0x320)
// Class FortniteUI.AthenaCollectionItemToastCharacter
class UAthenaCollectionItemToastCharacter : public UAthenaCollectionItemToast
{
public:
	class FText                                  NumLocationsFormat;                                // 0x320(0x18)(Edit, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_NumLocations;                             // 0x338(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCollectionItemToastCharacter* GetDefaultObj();

	void BP_OnLocationsSet(int32 NumFound, int32 NumLocations);
};

// 0x48 (0x368 - 0x320)
// Class FortniteUI.AthenaCollectionItemToastFishing
class UAthenaCollectionItemToastFishing : public UAthenaCollectionItemToast
{
public:
	class FText                                  LengthFormat;                                      // 0x320(0x18)(Edit, NativeAccessSpecifierPrivate)
	class FText                                  LeaderLengthFormat;                                // 0x338(0x18)(Edit, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_Length;                                   // 0x350(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_LeaderName;                                   // 0x358(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_LeaderLength;                             // 0x360(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCollectionItemToastFishing* GetDefaultObj();

	void BP_OnUnlockedNewClue();
	void BP_OnStarRatingSet(int32 StarRating);
	void BP_OnRankSet(int32 Rank, int32 NumEntries);
	void BP_OnNormalizedLengthSet(float NormalizedLength, float NormalizedMinLength, float NormalizedMaxLength);
};

// 0xA8 (0x358 - 0x2B0)
// Class FortniteUI.AthenaCollectionItemToastSwitcher
class UAthenaCollectionItemToastSwitcher : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_2C1[0x40];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnResetToast;                                      // 0x2F0(0x10)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	uint8                                        Pad_2C2[0x20];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TimeToShowToast;                                   // 0x320(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        ActivationDelay;                                   // 0x324(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFortPrioritizedWidgetData            PrioritizationData;                                // 0x328(0x2)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2C3[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonVisibilitySwitcher*             WidgetSwitcher_Toasts;                             // 0x330(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCollectionItemToast*            ActiveCollectionItemToastWidget;                   // 0x338(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2C5[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bHasPrioritizedWidgetFocus;                        // 0x350(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2C6[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCollectionItemToastSwitcher* GetDefaultObj();

};

// 0x38 (0x368 - 0x330)
// Class FortniteUI.AthenaCollectionLeaderboard
class UAthenaCollectionLeaderboard : public UCommonActivatableWidget
{
public:
	float                                        LeaderboardScrollSpeed;                            // 0x330(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        LeaderboardScrollInitialDelay;                     // 0x334(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScrollBox*                            ScrollBox_Leaderboard;                             // 0x338(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_Leaderboard;                              // 0x340(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2CB[0x20];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCollectionLeaderboard* GetDefaultObj();

};

// 0x20 (0x290 - 0x270)
// Class FortniteUI.AthenaCollectionOverlayEntry
class UAthenaCollectionOverlayEntry : public UCommonUserWidget
{
public:
	class FText                                  EmptyDisplayNameText;                              // 0x270(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_DisplayName;                                  // 0x288(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaCollectionOverlayEntry* GetDefaultObj();

	void BP_OnDisplayNameSet(const class FString& DisplayName);
};

// 0x40 (0x2D0 - 0x290)
// Class FortniteUI.AthenaCollectionLeaderboardEntry
class UAthenaCollectionLeaderboardEntry : public UAthenaCollectionOverlayEntry
{
public:
	class FText                                  ValueTextFormat;                                   // 0x290(0x18)(Edit, NativeAccessSpecifierPrivate)
	int32                                        ValueMinimumFractionalDigits;                      // 0x2A8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        ValueMaximumFractionalDigits;                      // 0x2AC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bValueIsFloat;                                     // 0x2B0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2D9[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_Placement;                                    // 0x2B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_Value;                                    // 0x2C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSocialAvatarIcon*                 AvatarIcon;                                        // 0x2C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCollectionLeaderboardEntry* GetDefaultObj();

	void BP_OnValueSet(float Value);
	void BP_OnPlacementSet(int32 Placement);
	void BP_OnLeaderboardEntryReset();
	void BP_OnLeaderboardEntryInitialized(bool bIsLocalPlayer);
};

// 0x18 (0x2E8 - 0x2D0)
// Class FortniteUI.AthenaCollectionLeaderboardEntryFishing
class UAthenaCollectionLeaderboardEntryFishing : public UAthenaCollectionLeaderboardEntry
{
public:
	class FName                                  ParamName_Has2Stars;                               // 0x2D0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  ParamName_Has3Stars;                               // 0x2D8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_Stars;                                       // 0x2E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCollectionLeaderboardEntryFishing* GetDefaultObj();

	void BP_OnStarRatingSet(int32 StarRating);
};

// 0x38 (0x2A8 - 0x270)
// Class FortniteUI.AthenaCollectionListColumnEntry
class UAthenaCollectionListColumnEntry : public UCommonUserWidget
{
public:
	uint8                                        Pad_2DF[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UDynamicEntryBox*                      EntryBox_ListEntries;                              // 0x278(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2E0[0x28];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCollectionListColumnEntry* GetDefaultObj();

};

// 0x38 (0xF30 - 0xEF8)
// Class FortniteUI.AthenaCollectionListEntry
class UAthenaCollectionListEntry : public UCommonButtonLegacy
{
public:
	uint8                                        Pad_2E7[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UImage*                                Image_Icon;                                        // 0xF08(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_Number;                                       // 0xF10(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ItemName;                                     // 0xF18(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2E9[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCollectionListEntry* GetDefaultObj();

	void BP_OnEntryReset();
	void BP_OnEntryImageSet();
	void BP_OnEntryIconLoaded(class UObject* EntryIcon);
	void BP_OnCollectionStateSet(enum class EFortCollectedState CollectedState);
	void BP_OnCollectedByFriendSet(bool bCollectedByFriend);
};

// 0x20 (0xF50 - 0xF30)
// Class FortniteUI.AthenaCollectionListEntryCharacter
class UAthenaCollectionListEntryCharacter : public UAthenaCollectionListEntry
{
public:
	class UImage*                                Image_Background;                                  // 0xF30(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  ParamName_ItemIcon;                                // 0xF38(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  ParamName_IsDiscovered;                            // 0xF40(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  ParamName_IsComplete;                              // 0xF48(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCollectionListEntryCharacter* GetDefaultObj();

	void BP_OnLocationsFoundSet(int32 NumFound, int32 NumAvailable, bool bAllFound);
};

// 0x30 (0xF60 - 0xF30)
// Class FortniteUI.AthenaCollectionListEntryFishing
class UAthenaCollectionListEntryFishing : public UAthenaCollectionListEntry
{
public:
	class FName                                  ParamName_ItemIcon;                                // 0xF30(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  ParamName_IsDiscovered;                            // 0xF38(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  ParamName_ItemSize;                                // 0xF40(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  ParamName_Has2Stars;                               // 0xF48(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  ParamName_Has3Stars;                               // 0xF50(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2FD[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCollectionListEntryFishing* GetDefaultObj();

	void BP_OnStarRatingSet(int32 StarRating);
	void BP_OnNormalizedLengthSet(float NormalizedLength, float NormalizedMinLength, float NormalizedMaxLength);
};

// 0x140 (0x358 - 0x218)
// Class FortniteUI.AthenaCollectionListView
class UAthenaCollectionListView : public UListViewBase
{
public:
	uint8                                        Pad_2FF[0xC0];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        EntrySpacing;                                      // 0x2D8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        NumRows;                                           // 0x2DC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_300[0x78];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCollectionListView* GetDefaultObj();

};

// 0x0 (0x290 - 0x290)
// Class FortniteUI.AthenaCollectionLocationEntry
class UAthenaCollectionLocationEntry : public UAthenaCollectionOverlayEntry
{
public:

	static class UClass* StaticClass();
	static class UAthenaCollectionLocationEntry* GetDefaultObj();

	void BP_OnLocationsFoundSet(enum class ELocationEntryState EntryState);
};

// 0x20 (0x290 - 0x270)
// Class FortniteUI.AthenaCollectionPlayerProgress
class UAthenaCollectionPlayerProgress : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                      Text_PlayerName;                                   // 0x270(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_Progress;                                     // 0x278(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSocialAvatarIcon*                 AvatarIcon;                                        // 0x280(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_307[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCollectionPlayerProgress* GetDefaultObj();

	bool IsLocalPlayer();
	int32 GetNumCollected();
	void BP_OnShowPlayerInfoSet(bool bShowPlayerInfo);
	void BP_OnPlayerProgressInitialized(bool bIsLocalPlayer, int32 NumCollected, int32 NumToCollect);
};

// 0x40 (0x2B0 - 0x270)
// Class FortniteUI.AthenaCollectionPlayerProgressContainer
class UAthenaCollectionPlayerProgressContainer : public UCommonUserWidget
{
public:
	TSubclassOf<class UAthenaCollectionPlayerProgress> PlayerProgressClass;                               // 0x270(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        CycleDelay;                                        // 0x278(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        ShowLocalPlayerAfterNumEntries;                    // 0x27C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UAthenaCollectionPlayerProgress*> CachedPlayerProgressEntries;                       // 0x280(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                        Pad_30D[0x20];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCollectionPlayerProgressContainer* GetDefaultObj();

	void BP_OnPlayerProgressEntriesCreated(TArray<class UAthenaCollectionPlayerProgress*>& PlayerProgressEntries, int32 NumToCollect);
	void BP_OnPlayerProgressContainerReset();
};

// 0x1C0 (0x4F0 - 0x330)
// Class FortniteUI.AthenaCollectionScreenBase
class UAthenaCollectionScreenBase : public UCommonActivatableWidget
{
public:
	uint8                                        Pad_313[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CollectionName;                                    // 0x340(0x18)(Edit, NativeAccessSpecifierPrivate)
	class FString                                CollectionType;                                    // 0x358(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                CollectionCategory;                                // 0x368(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                  UnknownText;                                       // 0x378(0x18)(Edit, NativeAccessSpecifierPrivate)
	class FText                                  UnknownDescription;                                // 0x390(0x18)(Edit, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UObject>                KnownEntryImage;                                   // 0x3A8(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UObject>                UnknownEntryImage;                                 // 0x3D0(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UObject>                KnownOverlayImage;                                 // 0x3F8(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UObject>                UnknownOverlayImage;                               // 0x420(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                  PersonalBestTextFormat;                            // 0x448(0x18)(Edit, NativeAccessSpecifierPrivate)
	uint8                                        PersonalBestMinimumFractionalDigits;               // 0x460(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        PersonalBestMaximumFractionalDigits;               // 0x461(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_315[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class UAthenaCollectionScreenInfoOverlay> SoftInfoOverlayClass;                              // 0x468(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScrollBox*                            ScrollBox_List;                                    // 0x490(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCollectionListView*             CollectionListView;                                // 0x498(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UContentWidget*                        Content_InfoOverlayContainer;                      // 0x4A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   Button_ToggleInfoOverlay;                          // 0x4A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   Button_Back;                                       // 0x4B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCollectionPlayerProgressContainer* PlayerProgressContainer;                           // 0x4B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bWantsToShowInfoOverlay;                           // 0x4C0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bForceOverlayToggleMobile;                         // 0x4C1(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_319[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaCollectionScreenInfoOverlay*    InfoOverlay;                                       // 0x4C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCollectionsDataTable*             CollectionsDataTable;                              // 0x4D0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCollectionData*                   CollectionData;                                    // 0x4D8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_31A[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCollectionScreenBase* GetDefaultObj();

	void CenterSelectedEntry();
	void BP_OnStartedLoading();
	void BP_OnInfoOverlayDeactivated();
	void BP_OnInfoOverlayActivated();
	void BP_OnHandleSelectedEntryChanged(class UAthenaCollectionListEntry* SelectedEntry);
	void BP_OnFinishedLoading();
};

// 0x0 (0x4F0 - 0x4F0)
// Class FortniteUI.AthenaCollectionScreenCharacter
class UAthenaCollectionScreenCharacter : public UAthenaCollectionScreenBase
{
public:

	static class UClass* StaticClass();
	static class UAthenaCollectionScreenCharacter* GetDefaultObj();

};

// 0xD0 (0x400 - 0x330)
// Class FortniteUI.AthenaCollectionScreenContainer
class UAthenaCollectionScreenContainer : public UCommonActivatableWidget
{
public:
	uint8                                        Pad_320[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FAthenaCollectionScreenContainerTabInfo> TabInfos;                                          // 0x338(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   NextTabInputAction;                                // 0x348(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   PreviousTabInputAction;                            // 0x358(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	class UCommonVisibilitySwitcher*             VisibilitySwitcher_Content;                        // 0x368(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_TabButtons;                               // 0x370(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_TabTitle;                                     // 0x378(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   MobileCloseButton;                                 // 0x380(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FAthenaCollectionScreenContainerTabInfo> ActiveTabInfos;                                    // 0x388(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_322[0x68];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCollectionScreenContainer* GetDefaultObj();

	void BP_OnShowTabsSet(bool bShowTabs);
};

// 0x28 (0xF20 - 0xEF8)
// Class FortniteUI.AthenaCollectionScreenContainerTabButton
class UAthenaCollectionScreenContainerTabButton : public UCommonButtonLegacy
{
public:
	class FString                                CollectionType;                                    // 0xEF8(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonLazyImage*                      LazyImage_Icon;                                    // 0xF08(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector2D                             ImageSize_Mobile;                                  // 0xF10(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_325[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCollectionScreenContainerTabButton* GetDefaultObj();

	void BP_ShowBang(bool bShow);
};

// 0x18 (0x508 - 0x4F0)
// Class FortniteUI.AthenaCollectionScreenFishing
class UAthenaCollectionScreenFishing : public UAthenaCollectionScreenBase
{
public:
	class FText                                  RequiresProFishingRodText;                         // 0x4F0(0x18)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCollectionScreenFishing* GetDefaultObj();

};

// 0xD0 (0x400 - 0x330)
// Class FortniteUI.AthenaCollectionScreenInfoOverlay
class UAthenaCollectionScreenInfoOverlay : public UCommonActivatableWidget
{
public:
	uint8                                        Pad_332[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  ParamName_ItemIcon;                                // 0x338(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  ParamName_IsDiscovered;                            // 0x340(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                  RichText_AdditionalInfo;                           // 0x348(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Image_ItemImage;                                   // 0x350(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                  NumCollectedTextFormat;                            // 0x358(0x18)(Edit, NativeAccessSpecifierPrivate)
	class FText                                  EmptyDisplayNameText;                              // 0x370(0x18)(Edit, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleLeaderboardRowHandle;                        // 0x388(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ItemType;                                     // 0x398(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ItemName;                                     // 0x3A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_Description;                              // 0x3A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_AdditionalDescription;                    // 0x3B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_FriendScores;                                // 0x3B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_NumCollected;                             // 0x3C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ItemNumber;                                   // 0x3C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   Button_Close;                                      // 0x3D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortDynamicEntryBox*                  EntryBox_InfoOverlay;                              // 0x3D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCollectionLeaderboard*          FriendLeaderboard;                                 // 0x3E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_339[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCollectionScreenInfoOverlay* GetDefaultObj();

	void BP_OnShowLeaderboard();
	void BP_OnItemIconLoaded(class UObject* ItemIcon);
	void BP_OnInfoOverlayReset();
	void BP_OnHideLeaderboard();
	void BP_OnHasAdditionalInfoSet(bool bHasAdditionalInfo);
	void BP_OnFriendScoresUpdated(int32 NumFriendScores);
	void BP_OnFriendLeaderboardDeactivated();
	void BP_OnFriendLeaderboardActivated();
	void BP_OnContextTagsUpdated(int32 NumContextTags);
	void BP_OnCollectedStateSet(enum class EFortCollectedState CollectedState);
};

// 0x8 (0x408 - 0x400)
// Class FortniteUI.AthenaCollectionScreenInfoOverlayCharacter
class UAthenaCollectionScreenInfoOverlayCharacter : public UAthenaCollectionScreenInfoOverlay
{
public:
	class FName                                  ParamName_Progress;                                // 0x400(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCollectionScreenInfoOverlayCharacter* GetDefaultObj();

	void BP_OnLocationsFoundSet(int32 NumFound, int32 NumAvailable, bool bAllFound);
};

// 0x48 (0x448 - 0x400)
// Class FortniteUI.AthenaCollectionScreenInfoOverlayFishing
class UAthenaCollectionScreenInfoOverlayFishing : public UAthenaCollectionScreenInfoOverlay
{
public:
	bool                                         bNeedsProFishingRod;                               // 0x400(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_340[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  NoneText;                                          // 0x408(0x18)(Edit, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_PersonalBest;                             // 0x420(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                  ScaleRangeTextFormat;                              // 0x428(0x18)(Edit, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_ScaleRange;                               // 0x440(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCollectionScreenInfoOverlayFishing* GetDefaultObj();

	void BP_OnStarRatingSet(int32 NumStars);
	void BP_OnNormalizedLengthSet(float NormalizedLength, float NormalizedMinLength, float NormalizedMaxLength);
};

// 0x48 (0x2F8 - 0x2B0)
// Class FortniteUI.AthenaCommonPrioritizedWidget
class UAthenaCommonPrioritizedWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_34B[0x40];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bAutoManagePriorityByVisibility;                   // 0x2F0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortPrioritizedWidgetData            PrioritizationData;                                // 0x2F1(0x2)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_34D[0x5];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCommonPrioritizedWidget* GetDefaultObj();

	void OnStompFailed();
	void OnStompedByOtherWidget();
	void K2_OnBecomeInactive();
	void K2_OnBecomeActive();
};

// 0x490 (0x740 - 0x2B0)
// Class FortniteUI.AthenaCompassBase
class UAthenaCompassBase : public UFortHUDElementWidget
{
public:
	class UMaterialInstanceDynamic*              CompassMaterial;                                   // 0x2B0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Image_Compass;                                     // 0x2B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateBrush                           MarkerBrush;                                       // 0x2C0(0xB0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                           HeadingIndicatorBrush;                             // 0x370(0xB0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                           StormIndicatorBrush;                               // 0x420(0xB0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                        MarkerVerticalOffset;                              // 0x4D0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DistanceTextVerticalOffset;                        // 0x4D4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DistanceTextHorizontalOffset;                      // 0x4D8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_35A[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSlateFontInfo                        HeadingFont;                                       // 0x4E0(0x58)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateFontInfo                        DistanceTextFont;                                  // 0x538(0x58)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateBrush                           TeammateGunshotIndicatorBrush;                     // 0x590(0xB0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                           EnemyGunshotIndicatorBrush;                        // 0x640(0xB0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                        TimeToShowGunshotIndicators;                       // 0x6F0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_35C[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UCurveFloat*                           GunshotIndicatorScaleOverTime;                     // 0x6F8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                           GunshotIndicatorScaleByStrength;                   // 0x700(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                           GunshotIndicatorAlphaOverTime;                     // 0x708(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                           GunshotIndicatorAlphaByHeading;                    // 0x710(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_35D[0x28];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCompassBase* GetDefaultObj();

};

// 0x50 (0x380 - 0x330)
// Class FortniteUI.AthenaConfirmationWindow
class UAthenaConfirmationWindow : public UCommonActivatableWidget
{
public:
	class UCommonTextBlock*                      Text_Title;                                        // 0x330(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_Description;                              // 0x338(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                        Image_MainIcon;                                    // 0x340(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_Buttons;                                  // 0x348(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBacchusCloseButton*                   Button_Close;                                      // 0x350(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonBorder*                         Border_TapToCloseZone;                             // 0x358(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   CancelAction;                                      // 0x360(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_363[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaConfirmationWindow* GetDefaultObj();

	void OnSetButtonText(class UCommonButtonLegacy* Button, class FText& Text);
	struct FEventReply HandleTapToCloseZoneMouseButtonDown(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent);
};

// 0x228 (0x510 - 0x2E8)
// Class FortniteUI.AthenaMarkedActorIndicator
class UAthenaMarkedActorIndicator : public UFortActorIndicatorWidget
{
public:
	uint8                                        Pad_369[0x28];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortWorldMarkerData                  MarkerData;                                        // 0x310(0x138)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FMarkedActorDisplayInfo               MarkerDisplay;                                     // 0x448(0x98)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class UFortMarkerDetailsTable*               DetailsTable;                                      // 0x4E0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FreshLargeItemShowTime;                            // 0x4E8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        IndicatorDotSizeThreshold;                         // 0x4EC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetSwitcher*                       Switcher_IndicatorSize;                            // 0x4F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_SmallIndicator;                              // 0x4F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_LargeIndicator;                              // 0x500(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_Distance;                                     // 0x508(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaMarkedActorIndicator* GetDefaultObj();

	void OnSetMarkerData(struct FFortWorldMarkerData& FortWorldMarkerData);
};

// 0x30 (0x540 - 0x510)
// Class FortniteUI.AthenaContextTutorialIndicator
class UAthenaContextTutorialIndicator : public UAthenaMarkedActorIndicator
{
public:
	float                                        OffscreenMaxTreshold;                              // 0x510(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_386[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UOverlay*                              Overlay_Icon_1;                                    // 0x518(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_387[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ScreenEdgePaddingSizePercent;                      // 0x524(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_388[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaContextTutorialIndicator* GetDefaultObj();

	void SwitchIndicatorSize();
	void SetScreenPercent(float Percent);
	void SetIndicatorText(class FText& Text);
	void PlayOutAnimation();
	void PlayInAnimation();
	void PlayBounceAnimation();
	float GetMinTreshold();
	float GetMaxTreshold();
	float GetMaxOffscreenTreshold();
	float GetCurrentDotProduct();
};

// 0x0 (0x358 - 0x358)
// Class FortniteUI.AthenaContextualChallengesWidget
class UAthenaContextualChallengesWidget : public UAthenaChallengesWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaContextualChallengesWidget* GetDefaultObj();

	bool ShouldOutroAutomatically();
	void OnResetOutroDelay();
	void OnNewContextualHeader(class FText& NewText);
	void HandleToggleFullscreenMap(bool bFullscreenMapVisible);
	void HandleNewContextualObjectives(TArray<class UFortQuestItem*>& InContextualQuests);
	float GetOutroDelay();
};

// 0x60 (0x2D0 - 0x270)
// Class FortniteUI.AthenaCosmeticUnlockingInfo
class UAthenaCosmeticUnlockingInfo : public UCommonUserWidget
{
public:
	class UCommonRichTextBlock*                  RichText_StaticUnlockingText;                      // 0x270(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_UnlockingText;                            // 0x278(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UProgressBar*                          ProgressBar_StepsCompleted;                        // 0x280(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_ProgressCompletion;                       // 0x288(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                EmphasisStyle;                                     // 0x290(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                ProgressCompletionNumericStyle;                    // 0x2A0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCosmeticItemDefinition*         CosmeticItemDef;                                   // 0x2B0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3B2[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCosmeticUnlockingInfo* GetDefaultObj();

	void ShowUnlockingInfoForCosmeticVariant(class UAthenaCosmeticItemDefinition* InCosmeticItemDef, struct FGameplayTag& InVariantChannel, struct FGameplayTag& InVariant);
	void ShowUnlockingInfoForCosmetic(class UAthenaCosmeticItemDefinition* InCosmeticItemDef);
	void ShowUnlockingInfo(class UAthenaCosmeticItemDefinition* UnlockItem, class UFortItemDefinition* UnlockSource);
	void ShowSeasonUnlockingInfo(int32 SeasonNumber, int32 TierNumber);
	void RequestUpdateAnim();
	void RequestOutroAnim();
	void RequestIntroAnim();
	void OutroAnimFinished();
	void OnUnlockingInfoSet(bool bShowProgression);
	void HideUnlockingInfo();
};

// 0x48 (0x2F8 - 0x2B0)
// Class FortniteUI.AthenaCountdownWidgetBase
class UAthenaCountdownWidgetBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_3C7[0x40];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortPrioritizedWidgetData            PrioritizationData;                                // 0x2F0(0x2)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_3C8[0x6];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCountdownWidgetBase* GetDefaultObj();

	void OnDisplayWarningMessage(class FText& FirstLineText, class FText& SecondLineText);
	void OnCountdownUpdate(int32 TimeRemaining, class FText& CountdownUpdateText);
	void OnCountdownStopped();
	void OnCountdownStarted(int32 TimeRemaining, class FText& CountdownIntroText);
	void OnCountdownFinished();
	void HandleGamePhaseStepChanged(TScriptInterface<class IFortSafeZoneInterface>& SafeZoneInterface, enum class EAthenaGamePhaseStep GamePhaseStep);
	void HandleCountdownUpdate(int32 TimeRemaining);
	void HandleCountdownStopped();
	void HandleCountdownStarted(int32 TimeRemaining);
	void HandleCountdownFinished();
};

// 0x1A8 (0x1D0 - 0x28)
// Class FortniteUI.AthenaCreativeItemEntryObjectWrapper
class UAthenaCreativeItemEntryObjectWrapper : public UObject
{
public:
	struct FFortItemEntry                        ItemEntry;                                         // 0x28(0x1A0)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                         bIsDownloading;                                    // 0x1C8(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3CF[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCreativeItemEntryObjectWrapper* GetDefaultObj();

};

// 0x1B8 (0x10B0 - 0xEF8)
// Class FortniteUI.AthenaCreativeItemTileButton
class UAthenaCreativeItemTileButton : public UCommonButtonLegacy
{
public:
	uint8                                        Pad_3DE[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaCreativeItemTileView*           ParentView;                                        // 0xF00(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItemDefinition*                   ItemDefinition;                                    // 0xF08(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortItemEntry                        ItemEntry;                                         // 0xF10(0x1A0)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaCreativeItemTileButton* GetDefaultObj();

	void OnLoadedItem();
	void OnEntryClick(class UAthenaCreativeItemTileButton* Entry);
	class UAthenaCreativeItemEntryObjectWrapper* MakeFortItemEntryObjectWrapper(class UObject* Target, struct FFortItemEntry& InItemEntry);
	int32 GetItemTypeCount();
	bool CompareToItemEntry(struct FFortItemEntry& InItemEntry);
};

// 0x20 (0xAC0 - 0xAA0)
// Class FortniteUI.AthenaCreativeItemTileView
class UAthenaCreativeItemTileView : public UCommonTileView
{
public:
	class UFortOptionsTab*                       ParentTab;                                         // 0xAA0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItem*                             CurrentlyFocusedItem;                              // 0xAA8(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3E0[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCreativeItemTileView* GetDefaultObj();

};

// 0x48 (0x2F8 - 0x2B0)
// Class FortniteUI.AthenaCurieStatusWidget
class UAthenaCurieStatusWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_3ED[0x48];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCurieStatusWidget* GetDefaultObj();

	void SetPlayerState(class AFortPlayerStateAthena* PlayerState);
	void OnPlayerStatePawnChanged();
	void OnHandleSpectatingChanged(class AFortPlayerStateZone* NewSpectatingTarget);
	void OnCurieStateRemoved(struct FGameplayTag& RemovedState);
	void OnCurieStateDetachedFromSpectator(class UObject* InOwner, const struct FCurieContainerHandle& ContainerHandle, struct FGameplayTag& ElementIdentifier);
	void OnCurieStateAttachedToSpectator(class UObject* InOwner, const struct FCurieContainerHandle& ContainerHandle, struct FGameplayTag& ElementIdentifier);
	void OnCurieStateAdded(struct FGameplayTag& AddedState);
	bool HasState(const struct FGameplayTag& CurieState);
};

// 0x140 (0x3B0 - 0x270)
// Class FortniteUI.FortItemPickerBase
class UFortItemPickerBase : public UCommonUserWidget
{
public:
	FMulticastInlineDelegateProperty_            OnSelectionChangedEvent;                           // 0x270(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_400[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnSelectionCommittedEvent;                         // 0x298(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_401[0x48];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnItemHoveredEvent;                                // 0x2F0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_402[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnItemUnhovered;                                   // 0x318(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_403[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortItemTileView*                     PickerTileView;                                    // 0x340(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UListView*                             ItemListViewWidget;                                // 0x348(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_405[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bConfirmSelectionIfAlreadySelectedAfterOneClick;   // 0x360(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_406[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UObject*                               NewlySelectedItem;                                 // 0x368(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TScriptInterface<class IFortItemViewContextInterface> ItemViewContext;                                   // 0x370(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_407[0x30];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortItemPickerBase* GetDefaultObj();

	bool TryCommitSelectedItem();
	void SetSelectedItem(class UFortItem* ItemToSelect);
	bool SetSelectedIndex(int32 Index);
	void OnItemSelectionScriptDelegate__DelegateSignature(class UFortItem* SelectedItem);
	bool IsNullItemExplicitlySelected();
	class UFortItem* GetSelectedItem();
	TScriptInterface<class IFortItemListViewInterface> GetListViewInterface();
	int32 GetIndexForItem(class UFortItem* Item);
	void ClearSelection();
	void CenterSelectedItemTileWidget();
	bool CanItemBeComitted(class UFortItem* ItemToCommit);
};

// 0x108 (0x4B8 - 0x3B0)
// Class FortniteUI.AthenaCustomizationPicker
class UAthenaCustomizationPicker : public UFortItemPickerBase
{
public:
	FMulticastInlineDelegateProperty_            OnCosmeticSelectionSaving;                         // 0x3B0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCosmeticSelectionSaved;                          // 0x3C0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMap<enum class EInventoryContentSortType, class FText> SortLabels;                                        // 0x3D0(0x50)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FFortAthenaItemManagementInventoryFilterTabLabelInfo> FilterTabLabelInfoArray;                           // 0x420(0x10)(Edit, EditFixedSize, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_JumpToTop;                                  // 0x430(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_SortAndFilter;                              // 0x438(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  CurrentFilterName;                                 // 0x440(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_428[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_SortTag;                                      // 0x458(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_FilterTag;                                    // 0x460(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EAthenaCustomizationCategory      CustomizeCategory;                                 // 0x468(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_429[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SubslotIndex;                                      // 0x46C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        ItemOffsetForJumpToTopButton;                      // 0x470(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_42A[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaCustomizationPickerSortAndFilterBlade* Blade_SortAndFilter;                               // 0x478(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAllowUnownedItems;                                // 0x480(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAllowCommits;                                     // 0x481(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bOneItemPerSlot;                                   // 0x482(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_42B[0x15];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UObject*>                       InitialPickerItems;                                // 0x498(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class UFortItem*                             ItemListeningTo;                                   // 0x4A8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCosmeticAccountItem*            LocalCampaignHeroItem;                             // 0x4B0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCustomizationPicker* GetDefaultObj();

	void SetFilter(class FName FilterName);
	void SearchText(class FText& Text);
	void OnSearchEnabled(bool bEnabled);
	void OnNoItemsAvailableInFilter(class FText& EmptyDisplayText);
	void OnItemsAvailableInFilter();
	void OnCosmeticChangeSaveEvent__DelegateSignature();
	void HandleSelectedItemHasChanged(bool ItemChanged, bool AmmoChanged, bool IngredientsChanged);
	class FText GetQualifiedFilterDisplayName(enum class EAthenaFilterDisplayType InTopFilterDisplaySetting);
	void EndCustomizationCategory();
	void BP_OnJumpToTopClicked();
	void BeginCustomizationCategory(enum class EAthenaCustomizationCategory Category, int32 SubslotToEdit, bool bInAllowUnownedItems, bool bInOneItemPerSlot);
};

// 0xD0 (0x340 - 0x270)
// Class FortniteUI.AthenaCustomizationPickerSortAndFilterBlade
class UAthenaCustomizationPickerSortAndFilterBlade : public UCommonUserWidget
{
public:
	class UWidget*                               Widget_Sorts;                                      // 0x270(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                               Widget_Filters;                                    // 0x278(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortDynamicEntryBox*                  DynamicEntryBox_SortButtons;                       // 0x280(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortDynamicEntryBox*                  DynamicEntryBox_FilterButtons;                     // 0x288(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonGroupBase*                ButtonGroup_Sorts;                                 // 0x290(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonGroupBase*                ButtonGroup_Filters;                               // 0x298(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_443[0xA0];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCustomizationPickerSortAndFilterBlade* GetDefaultObj();

	bool IsBladeOpen();
	void HandleCloseAnimationFinished();
	class UCommonButtonBase* GetSortButtonAtIndex(int32 DesiredIndex);
	int32 GetNumSorts();
	int32 GetNumFilters();
	class UCommonButtonBase* GetFilterButtonAtIndex(int32 DesiredIndex);
	void CloseBlade();
	void BP_SetSortOrFilterButtonDisplayName(class UCommonButtonBase* SortOrFilterButton, class FText& DisplayName);
	void BP_OnSortOrFilterButtonCreated(class UCommonButtonBase* NewButton);
	void BP_OnBladeOpen();
	void BP_OnBladeClose();
};

// 0x28 (0xF20 - 0xEF8)
// Class FortniteUI.FortCosmeticItemTileButton
class UFortCosmeticItemTileButton : public UCommonButtonLegacy
{
public:
	uint8                                        Pad_44C[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortCosmeticItemCard*                 ItemWidget;                                        // 0xF00(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFortItem>              Item;                                              // 0xF08(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ItemCardWidth;                                     // 0xF10(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MobileScalingFactor;                               // 0xF14(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_450[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortCosmeticItemTileButton* GetDefaultObj();

};

// 0x20 (0xF40 - 0xF20)
// Class FortniteUI.AthenaCustomizationPickerTileButton
class UAthenaCustomizationPickerTileButton : public UFortCosmeticItemTileButton
{
public:
	class UFortBangWrapper_NUI*                  Bang;                                              // 0xF20(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_Favorite;                                    // 0xF28(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_ClassIcon;                                   // 0xF30(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_45F[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCustomizationPickerTileButton* GetDefaultObj();

	void OnUpdateExclusiveWarning(bool bShouldWarn);
	void OnEquippedStateChanged(bool bEquipped, bool bOnDifferentSlot);
	void OnChangeOwnedState(bool bOwned);
};

// 0x4D0 (0xAA8 - 0x5D8)
// Class FortniteUI.AthenaCustomizationScreen
class UAthenaCustomizationScreen : public UFortItemPreviewScreen
{
public:
	bool                                         bCustomizationSelectionBeingProcessed;             // 0x5D8(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_47F[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAthenaCustomizationParams            CustomizationParams;                               // 0x5E0(0x48)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	enum class EAthenaCustomizationCategory      InitialCustomizationCategory;                      // 0x628(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_483[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CategoryDisplayNames[0x16];                        // 0x630(0x210)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FText                                  ItemTypeDisplayNames[0x16];                        // 0x840(0x210)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                        Pad_484[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UAthenaItemSelectorScreenBase> ItemSelectorScreenClass;                           // 0xA68(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaItemSelectorScreenBase*         ItemSelectorScreen;                                // 0xA70(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_486[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   OpenNameLoadoutInputAction;                        // 0xA80(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                      BoundAnim_Intro;                                   // 0xA90(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                      BoundAnim_Outro;                                   // 0xA98(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortCosmeticLoadoutSelector*          LoadoutSelector;                                   // 0xAA0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCustomizationScreen* GetDefaultObj();

	void ShowLockerSlot(enum class EAthenaCustomizationCategory CustomizationCategory, int32 SlotIndex, bool bCanShowEmpty);
	void ShiftItemsVariantOption(class UAthenaCosmeticAccountItem* Item, int32 VariantChannelIndex);
	void SetCustomizationSelectionBeingProcessed(bool bIsBeingProcessed);
	void OnLoadoutChanged();
	class FText GetItemTypeDisplayNames(enum class EAthenaCustomizationCategory InCategory);
	class UFortItem* GetFavoriteItemForCategory(enum class EAthenaCustomizationCategory CustomizationType, int32 SubslotIndex);
	class FText GetCategoryDisplayName(enum class EAthenaCustomizationCategory InCategory);
};

// 0x728 (0xD00 - 0x5D8)
// Class FortniteUI.AthenaCustomizationScreenBase
class UAthenaCustomizationScreenBase : public UFortItemPreviewScreen
{
public:
	bool                                         bCustomizationSelectionBeingProcessed;             // 0x5D8(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4C6[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAthenaCustomizationParams            CustomizationParams;                               // 0x5E0(0x48)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	enum class EAthenaCustomizationCategory      FirstCustomizationCategory;                        // 0x628(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4C9[0x16F];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CategoryDisplayNames[0x16];                        // 0x798(0x210)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FText                                  ItemTypeDisplayNames[0x16];                        // 0x9A8(0x210)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                        Pad_4CC[0x30];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UAthenaItemSelectorScreenBase> ItemSelectorScreenClass;                           // 0xBE8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortActivatablePanel>     LoadoutSelectorScreenClass;                        // 0xBF0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortBannerSelectModal>    BannerSelectModalClass;                            // 0xBF8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortNameLoadoutPopup>     NameLoadoutPopupClass;                             // 0xC00(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortProgressModal>        ProgressModalClass;                                // 0xC08(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortProgressModal*                    ProgressModalInstance;                             // 0xC10(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_4CF[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaCustomizationSlotSelectorButton* LastHoveredSlot;                                   // 0xC20(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_4D1[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   OpenNameLoadoutInputAction;                        // 0xC30(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	TArray<enum class EAthenaCustomizationCategory> BuiltInEmoteCategoryPriorities;                    // 0xC40(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                         bDisplayBuiltInEmotesInEmoteRow;                   // 0xC50(0x1)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_4D3[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UWidgetAnimation*                      BoundAnim_Intro;                                   // 0xC58(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                      BoundAnim_Outro;                                   // 0xC60(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                               Container_Loadouts_GodTileArea;                    // 0xC68(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   Button_Loadouts;                                   // 0xC70(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   Button_SavePreset;                                 // 0xC78(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   Button_RandomPresets;                              // 0xC80(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortCosmeticLoadoutSelector*          Loadout_Selector;                                  // 0xC88(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortCosmeticLoadoutCard*              LoadoutCard_AppliedAnimation;                      // 0xC90(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_GearSlotRow;                                 // 0xC98(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCustomizationSlotSelectorButton* Slot_Pickaxe;                                      // 0xCA0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCustomizationSlotSelectorButton* Slot_Glider;                                       // 0xCA8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCustomizationSlotSelectorButton* Slot_Contrail;                                     // 0xCB0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCustomizationSlotSelectorButton* Slot_LoadingScreen;                                // 0xCB8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_EmoteSlotRow;                                // 0xCC0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_WrapSlotRow;                                 // 0xCC8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_AccountSlotRow;                              // 0xCD0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBannerSlotButton*                 Banner_Button;                                     // 0xCD8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaLockerItemInfo*                 ItemInfo_Display;                                  // 0xCE0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                               Widget_BangButtonContainer;                        // 0xCE8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_ClearAllBangs_Gamepad;                      // 0xCF0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortHoldableButton*                   HoldableButton_ClearAllBangs_Click;                // 0xCF8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCustomizationScreenBase* GetDefaultObj();

	void ShowLockerSlot(enum class EAthenaCustomizationCategory CustomizationCategory, int32 SlotIndex, bool bCanShowEmpty);
	bool ShouldDisplayNextRandomPresetName();
	void ShiftItemsVariantOption(class UAthenaCosmeticAccountItem* Item, int32 VariantChannelIndex);
	void SetCustomizationSelectionBeingProcessed(bool bIsBeingProcessed);
	void OnRefreshForNewLoadout(const class FString& LoadoutName, bool bIsShuffleTile);
	void OnPlayerToggledRandomPresets(bool bNowEnabled);
	void OnIntroAppliedPreset();
	void OnBeginSavingLoadouts();
	void OnBeginPickingLoadouts();
	void OnBeginPickingCustomizationSlot(class UAthenaCustomizationSlotSelectorButton* SlotButton);
	void HandleInventoryUpdated(TSet<class FString>& ItemChangeFlags, int64 ProfileRevision);
	class FText GetItemTypeDisplayNames(enum class EAthenaCustomizationCategory InCategory);
	class UFortItem* GetFavoriteItemForCategory(enum class EAthenaCustomizationCategory CustomizationType, int32 SubslotIndex);
	class FText GetCategoryDisplayName(enum class EAthenaCustomizationCategory InCategory);
};

// 0xC8 (0xFC0 - 0xEF8)
// Class FortniteUI.AthenaCustomizationSlotSelectorButton
class UAthenaCustomizationSlotSelectorButton : public UCommonButtonLegacy
{
public:
	class FText                                  CategoryDisplayName;                               // 0xEF8(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                  CategoryDescription;                               // 0xF10(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	enum class EAthenaCustomizationCategory      CustomizationType;                                 // 0xF28(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_507[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SubslotIndex;                                      // 0xF2C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortBangType                     BangType;                                          // 0xF30(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAllowUnownedItems;                                // 0xF31(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bOneItemPerSlot;                                   // 0xF32(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_509[0x5];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UMaterialInstance*                     OverrideSlotImage;                                 // 0xF38(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCosmeticItemCard*                 ItemWidget;                                        // 0xF40(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                          RequiredSlotGameplayTag;                           // 0xF48(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>             DefaultEmptyTexture;                               // 0xF50(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CardWidth;                                         // 0xF78(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_50C[0x24];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortItem*                             LocalCampaignHeroPartItem;                         // 0xFA0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_Favorite;                                    // 0xFA8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_ClassIcon;                                   // 0xFB0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBangWrapper_NUI*                  Bang_Wrapper;                                      // 0xFB8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCustomizationSlotSelectorButton* GetDefaultObj();

	void SetCustomizationType(enum class EAthenaCustomizationCategory NewType, int32 InSubslotIndex, struct FGameplayTag& RequiredSlotTag);
	void SetCardDefaultImageAndWidth(TSoftObjectPtr<class UTexture2D>& InDefaultImage, float InWidth);
	void OnUpdateExclusiveWarning(bool bShouldWarn);
	void OnCustomizationSlotActiveStateChanged(bool bInAttachableCosmeticAvailable, bool bInActive);
	void OnCardImageAndWidthChanged(TSoftObjectPtr<class UTexture2D>& Image, float Width);
	bool IsSlotFilled();
	void HandleDifferentHeroLoadoutActivated(class UFortMcpProfileCampaign* Profile);
	void GetCustomizationSlotActiveState(bool* bOutAttachableCosmeticAvailable, bool* bOutActive);
	class UFortItem* GetCampaignHeroPartItem();
};

// 0x58 (0x308 - 0x2B0)
// Class FortniteUI.AthenaDiscoverabilityBase
class UAthenaDiscoverabilityBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_51B[0x48];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortPrioritizedWidgetData            PrioritizationData;                                // 0x2F8(0x2)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_51C[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortControllerComponent_MapDiscoverability* AssociatedComponent;                               // 0x300(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaDiscoverabilityBase* GetDefaultObj();

	void OnStompFailed();
	void OnStompedByOtherWidget();
	void K2_OnBecomeInactive();
	void K2_OnBecomeActive();
	void CommonArrivalEvent(struct FGameplayTag& NewTag);
};

// 0x0 (0x308 - 0x308)
// Class FortniteUI.AthenaDiscoveredAreaOverlay
class UAthenaDiscoveredAreaOverlay : public UAthenaDiscoverabilityBase
{
public:

	static class UClass* StaticClass();
	static class UAthenaDiscoveredAreaOverlay* GetDefaultObj();

	void OnNewDiscovery(class FText& LocalizedLocationName, bool bIsNamedLocation);
};

// 0xA0 (0x350 - 0x2B0)
// Class FortniteUI.AthenaDuelOverlay
class UAthenaDuelOverlay : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_531[0x40];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonRichTextBlock*                  RichText_Title;                                    // 0x2F0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                  RichText_SubTitle;                                 // 0x2F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Image_ChallengedNPCPortrait;                       // 0x300(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Image_ElimPortrait;                                // 0x308(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Image_Reward;                                      // 0x310(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class USoundBase>             DuelStartedSound;                                  // 0x318(0x28)(Edit, BlueprintVisible, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_535[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortPrioritizedWidgetData            PrioritizedWidgetData;                             // 0x348(0x2)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_536[0x6];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaDuelOverlay* GetDefaultObj();

	void OnShowOverlay();
	void OnSetupForActivation(enum class EDuelState DuelState, struct FFortColorPalette& RarityColorPalette);
	void OnOutroOverlay();
	void HandleDuelUpdate(enum class EDuelState DuelState, struct FDuelOverlayData& DuelOverlayData);
};

// 0x50 (0xF48 - 0xEF8)
// Class FortniteUI.AthenaMtxOfferButtonBaseLegacy
class UAthenaMtxOfferButtonBaseLegacy : public UCommonButtonLegacy
{
public:
	uint8                                        Pad_541[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortStoreFrontOfferInfo*              OfferData;                                         // 0xF00(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_MtxAmount;                                    // 0xF08(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_RealMoneyPrice;                               // 0xF10(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonVisibilitySwitcher*             OptionalSwitcher_CurrencyIcons;                    // 0xF18(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                OptionalIMG_StarterKit;                            // 0xF20(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonLoadGuard*                      LoadGuardCurrencySpinner;                          // 0xF28(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_545[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaMtxOfferButtonBaseLegacy* GetDefaultObj();

	void HandleMtxPurchaseComplete(bool bSuccess, TArray<struct FPurchasedItemInfo>& PurchasedItems);
};

// 0x8 (0xF50 - 0xF48)
// Class FortniteUI.AthenaDynamicMtxOfferButtonLegacy
class UAthenaDynamicMtxOfferButtonLegacy : public UAthenaMtxOfferButtonBaseLegacy
{
public:
	class UCommonTextBlock*                      Text_DynamicMtxAmount;                             // 0xF48(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaDynamicMtxOfferButtonLegacy* GetDefaultObj();

};

// 0x98 (0x670 - 0x5D8)
// Class FortniteUI.AthenaReloadMtxScreenBaseLegacy
class UAthenaReloadMtxScreenBaseLegacy : public UFortItemPreviewScreen
{
public:
	uint8                                        Pad_54B[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortStoreFrontOfferInfo*              OfferInfo;                                         // 0x5E0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_54D[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_AmountNeeded;                                 // 0x5F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_550[0x40];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UFortAccountItemDefinition*>    AccountItemDefinitions;                            // 0x640(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   BackAction;                                        // 0x650(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   Button_MobileClose;                                // 0x660(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaSmallOfferPreviewBase*          SmallOfferPreview_Widget;                          // 0x668(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaReloadMtxScreenBaseLegacy* GetDefaultObj();

	void HandleBackButton(bool* bPassThrough);
};

// 0x70 (0x6E0 - 0x670)
// Class FortniteUI.AthenaDynamicReloadMtxScreenLegacy
class UAthenaDynamicReloadMtxScreenLegacy : public UAthenaReloadMtxScreenBaseLegacy
{
public:
	class UCommonTextBlock*                      Text_TotalNeeded;                                  // 0x670(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_CurrentBalance;                               // 0x678(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonVisibilitySwitcher*             Switcher_DynamicOptions;                           // 0x680(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaStarterKitOfferButtonLegacy*    Button_StarterKitOption;                           // 0x688(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                              Overlay_MtxRequired;                               // 0x690(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                              Overlay_StarterKit;                                // 0x698(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaDynamicMtxOfferButtonLegacy*    Button_MtxRequiredOption;                          // 0x6A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaStaticMtxOfferButtonLegacy*     Button_MtxOtherOption;                             // 0x6A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   Button_MoreOptions;                                // 0x6B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FName>                          StorefrontNames;                                   // 0x6B8(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	class UAthenaReloadMtxScreenLegacy*          StaticReloadMtxScreen;                             // 0x6C8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   MtxRequiredButtonToFocus;                          // 0x6D0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_55E[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaDynamicReloadMtxScreenLegacy* GetDefaultObj();

	class UWidget* GetMtxRequiredButtonToFocus(enum class EUINavigation InNavigation);
};

// 0x8 (0x518 - 0x510)
// Class FortniteUI.AthenaEliminationIndicator
class UAthenaEliminationIndicator : public UAthenaMarkedActorIndicator
{
public:
	uint8                                        Pad_561[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaEliminationIndicator* GetDefaultObj();

};

// 0x0 (0x248 - 0x248)
// Class FortniteUI.AthenaEliminationOverlayBase
class UAthenaEliminationOverlayBase : public UUserWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaEliminationOverlayBase* GetDefaultObj();

};

// 0x0 (0x270 - 0x270)
// Class FortniteUI.AthenaEndGamePlacementWidget
class UAthenaEndGamePlacementWidget : public UCommonUserWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaEndGamePlacementWidget* GetDefaultObj();

	void SetPlacement(int32 NewPlacement);
	void Activate();
};

// 0x78 (0x370 - 0x2F8)
// Class FortniteUI.AthenaEquippedItemBase
class UAthenaEquippedItemBase : public UBacchusHUDElement
{
public:
	enum class EEquippedWeaponDisplay            CurrentMode;                                       // 0x2F8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_5A1[0xB];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        AmountConsideredInfinite;                          // 0x304(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonVisibilitySwitcher*             Switcher_Content;                                  // 0x308(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_ResourceContent;                             // 0x310(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_AmmoContent;                                 // 0x318(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_UtilityContent;                              // 0x320(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_AmmoIcon;                                    // 0x328(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_ResourceIcon;                                // 0x330(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_UtilityIcon;                                 // 0x338(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_MagazineAmmoCount;                            // 0x340(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_SurplusAmmoCount;                             // 0x348(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ResourceCount;                                // 0x350(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_UtilityAmmoCount;                             // 0x358(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_OutOfAmmo;                                    // 0x360(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class ESlateVisibility                  WeaponEquipVisibility;                             // 0x368(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_5A6[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaEquippedItemBase* GetDefaultObj();

	void HandleWorldItemsChanged();
	void HandleWeaponTargetingChanged(bool bIsTargeting);
	void HandleWeaponReloadStarted(float ReloadTime, enum class EFortWeaponReloadType ReloadType);
	void HandleWeaponReloadCancelled();
	void HandleWeaponOverheatValueChanged(float CurrentValue, float MaxValue, enum class EFortWeaponOverheatState State, bool bIsInCooldown);
	void HandleWeaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void HandleViewTargetChanged();
	void HandleSecondaryFireReleased(class AFortWeapon* Weapon);
	void HandleSecondaryFirePressed(class AFortWeapon* Weapon);
	void HandleLocalAmmoChanged(int32 LocalCount, int32 LocalRemaining);
	void HandleBuildingMaterialChanged();
	void BP_HandleWeaponTargetingChanged(bool bIsTargeting);
	void BP_HandleWeaponReloadStarted(float ReloadTime, enum class EFortWeaponReloadType ReloadType);
	void BP_HandleWeaponReloadCancelled(class AFortWeapon* Weapon);
	void BP_HandleWeaponOverheatValueChanged(float CurrentValue, float MaxValue, enum class EFortWeaponOverheatState State, bool bIsInCooldown);
	void BP_HandleWeaponModeChanged(enum class EEquippedWeaponDisplay Mode);
	void BP_HandleWeaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void BP_HandleSecondaryFireReleased();
	void BP_HandleSecondaryFirePressed();
	void BP_HandleResourceTypeChanged(class UFortResourceItemDefinition* Item, int32 ResourceCount);
	void BP_HandleResourceCountChanged(int32 ResourceCount);
	void BP_HandleHideReserveAmmoChanged(bool bHideReserveAmmo);
	void BP_HandleHasBulletsPerClipChanged(bool bHasBulletsPerClip);
	void BP_HandleHasAmmoChanged(bool bHasAmmo);
	void BP_HandleAmmoCountChanged(int32 MagazineAmmoCount, int32 SurplusAmmoCount, int32 TotalRemaining);
};

// 0x70 (0x3E0 - 0x370)
// Class FortniteUI.AthenaEquippedItemInfoWidget
class UAthenaEquippedItemInfoWidget : public UAthenaEquippedItemBase
{
public:
	uint8                                        Pad_5B0[0x70];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaEquippedItemInfoWidget* GetDefaultObj();

	void OnExtensionWidgetAdded(class UUserWidget* ExtensionWidget);
};

// 0x0 (0x4A0 - 0x4A0)
// Class FortniteUI.AthenaEventGamesBase
class UAthenaEventGamesBase : public UFortActivatablePanel
{
public:

	static class UClass* StaticClass();
	static class UAthenaEventGamesBase* GetDefaultObj();

};

// 0x0 (0x4A0 - 0x4A0)
// Class FortniteUI.AthenaEventScreenBase
class UAthenaEventScreenBase : public UFortActivatablePanel
{
public:

	static class UClass* StaticClass();
	static class UAthenaEventScreenBase* GetDefaultObj();

};

// 0x28 (0x4C8 - 0x4A0)
// Class FortniteUI.AthenaEventMatchActiveGridScreenBase
class UAthenaEventMatchActiveGridScreenBase : public UAthenaEventScreenBase
{
public:
	TSubclassOf<class UAthenaEventMatchTeamWidgetBase> TeamWidgetClass;                                   // 0x4A0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAthenaEventMatchTeamWidgetBase*> ActiveTeams;                                       // 0x4A8(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	int32                                        MaxNumColumns;                                     // 0x4B8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxTeamCount;                                      // 0x4BC(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxTeamSize;                                       // 0x4C0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_5BE[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaEventMatchActiveGridScreenBase* GetDefaultObj();

	void OnTeamEliminated_BP();
	void OnTeamEliminated(int32 InSquadId);
	void OnTeamChanged_BP();
};

// 0x28 (0x4C8 - 0x4A0)
// Class FortniteUI.AthenaEventMatchEliminatedGridScreenBase
class UAthenaEventMatchEliminatedGridScreenBase : public UAthenaEventScreenBase
{
public:
	TSubclassOf<class UAthenaEventMatchTeamWidgetBase> TeamWidgetClass;                                   // 0x4A0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAthenaEventMatchTeamWidgetBase*> EliminatedTeams;                                   // 0x4A8(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	int32                                        MaxNumColumns;                                     // 0x4B8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxTeamCount;                                      // 0x4BC(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxTeamSize;                                       // 0x4C0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_5C6[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaEventMatchEliminatedGridScreenBase* GetDefaultObj();

	void OnTeamEliminated_BP();
	void OnPlayerEliminatedStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsEliminated);
};

// 0x18 (0xF10 - 0xEF8)
// Class FortniteUI.AthenaEventMatchPlayerWidgetBase
class UAthenaEventMatchPlayerWidgetBase : public UCommonButtonLegacy
{
public:
	uint8                                        Pad_634[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TWeakObjectPtr<class UAthenaRemotePlayerViewData> PlayerData;                                        // 0xF00(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_635[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaEventMatchPlayerWidgetBase* GetDefaultObj();

	void SetPlayerData(class UAthenaRemotePlayerViewData* InPlayerData);
	void OnTeamColorChanged(class UAthenaRemotePlayerViewData* InPlayerData, const struct FLinearColor& InTeamColor);
	void OnSquadIdChanged(class UAthenaRemotePlayerViewData* InPlayerData, uint8 InSquadId);
	void OnShieldHealed(class UAthenaRemotePlayerViewData* InPlayerData, float InShield, float InShieldMax);
	void OnShieldDamaged(class UAthenaRemotePlayerViewData* InPlayerData, float InShield, float InShieldMax);
	void OnPlayerStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, class AFortPlayerStateAthena* InPlayerState);
	void OnPlayerPawnChanged(class UAthenaRemotePlayerViewData* InPlayerData, class AFortPlayerPawn* InPlayerPawn);
	void OnPlayerNameChanged(class UAthenaRemotePlayerViewData* InPlayerData, const class FString& InPlayerName);
	void OnPlayerDataChanged(class UAthenaRemotePlayerViewData* InPlayerData);
	void OnPlaceChanged(class UAthenaRemotePlayerViewData* InPlayerData, int32 InPlace);
	void OnMaterialCountChanged(class UAthenaRemotePlayerViewData* InPlayerData, int32 InCount);
	void OnLocationChanged(class UAthenaRemotePlayerViewData* InPlayerData, const class FString& InLocation);
	void OnKillScoreChanged(class UAthenaRemotePlayerViewData* InPlayerData, int32 InKillScore);
	void OnIsReplayRelevancyPlayerChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsReplayRelevancyPlayer);
	void OnIsInRelevancyChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsInRelevancy);
	void OnIsFollowedPlayerChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsFollowedPlayer);
	void OnHealthHealed(class UAthenaRemotePlayerViewData* InPlayerData, float InHealth, float InHealthMax);
	void OnHealthDamaged(class UAthenaRemotePlayerViewData* InPlayerData, float InHealth, float InHealthMax);
	void OnDisconnectedChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bIsDisconnected);
	void OnDeadStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bIsDead);
	void OnDBNOStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bIsDBNO);
	void OnBeingRevivedStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bIsBeingRevived);
};

// 0x0 (0xF10 - 0xF10)
// Class FortniteUI.AthenaEventMatchScoreboardPlayerWidgetBase
