#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x706 (0x3246 - 0x2B40)
// BlueprintGeneratedClass NPC_Pawn_Parent.NPC_Pawn_Parent_C
class ANPC_Pawn_Parent_C : public AEnemyPawn_Parent_Deimos_C
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x2B40(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortActorComponent_Affiliation*       FortActorComponent_Affiliation;                    // 0x2B48(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USoundLibraryComponent*                SoundLibrary_Component;                            // 0x2B50(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                       MovementAudioComponent;                            // 0x2B58(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNPC_VoiceComponent_C*                 NPC_VoiceComponent;                                // 0x2B60(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                       VOAudioComponent;                                  // 0x2B68(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortWidgetComponent*                  NPCStatusWidget;                                   // 0x2B70(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        Timeline_ScaleMeshInOrOut_MeshScaleAlpha_9DAAC0B243D26E4160CEC3A458AE0E86; // 0x2B78(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETimelineDirection                Timeline_ScaleMeshInOrOut__Direction_9DAAC0B243D26E4160CEC3A458AE0E86; // 0x2B7C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_611E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTimelineComponent*                    Timeline_ScaleMeshInOrOut;                         // 0x2B80(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                GE_NPC_RecentlyDamaged;                            // 0x2B88(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class Enum_NPC_AlertLevel               NPC_AlertLevel;                                    // 0x2B90(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	enum class Enum_NPC_AlertLevel               NPC_AlertLevelPrevious;                            // 0x2B91(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_611F[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<enum class Enum_NPC_AlertLevel, struct FGameplayTag> NPC_AlertLevelToTagMap;                            // 0x2B98(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         NPC_StatusWidgetHealthBarDisabled;                 // 0x2BE8(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6120[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          GameplayCue_PickupGrabbed;                         // 0x2BEC(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	enum class EFortRarity                       NPC_BestLootRarityInInventory;                     // 0x2BF4(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                         NPC_DebugPawn;                                     // 0x2BF5(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         NPC_ShowInventoryRarityVisuals;                    // 0x2BF6(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6121[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        InventoryGlowDelay;                                // 0x2BF8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6122[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FScalableFloat                        NPC_NumberOfInventoryItemsToDeliverHF;             // 0x2C00(0x28)(Edit, BlueprintVisible)
	bool                                         NPC_SpawnInvisible;                                // 0x2C28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         NPC_ScaleMeshInOnSpawn;                            // 0x2C29(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6123[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 TC_NPC_SpawnAbilityTag;                            // 0x2C30(0x20)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                 TC_NPC_AlternateSpawnAbilityTag;                   // 0x2C50(0x20)(Edit, BlueprintVisible)
	bool                                         NPC_IsSpawning;                                    // 0x2C70(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6125[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        NPC_OriginalGravityScale;                          // 0x2C74(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                              NPC_OriginalRotationRate;                          // 0x2C78(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         NPC_HasPawnGoal;                                   // 0x2C84(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6126[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                NPC_PawnGoalActor;                                 // 0x2C88(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                        NPC_NumberOfInventoryItemsToConsumeBeforeFullHF;   // 0x2C90(0x28)(Edit, BlueprintVisible)
	bool                                         NPC_PawnIsDestroyingBuildingForNavigation;         // 0x2CB8(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6129[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FScalableFloat                        MaxIdleVODelay;                                    // 0x2CC0(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        MinIdleVODelay;                                    // 0x2CE8(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        NPC_DeathDropLootDelay;                            // 0x2D10(0x28)(Edit, BlueprintVisible)
	class FName                                  NPC_DeathDropLootTierGroupName;                    // 0x2D38(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                 NPC_DeathDropLootRequiredDamageTags;               // 0x2D40(0x20)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                 NPC_DeathDropLootForbiddenDamageTags;              // 0x2D60(0x20)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                 GrantStartingItemsAbilityTC;                       // 0x2D80(0x20)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         NPC_HasItemInInventory;                            // 0x2DA0(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_612A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          VoiceTag_FullAlertIdle;                            // 0x2DA4(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          VoiceTag_Idle;                                     // 0x2DAC(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          VoiceTag_ReturnToIdle;                             // 0x2DB4(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          VoiceTag_LostTarget;                               // 0x2DBC(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          VoiceTag_Suspicious;                               // 0x2DC4(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          VoiceTag_FullAlert;                                // 0x2DCC(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_612C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FStruct_NPC_TargetSlots>       NPC_TargetSlotsHF;                                 // 0x2DD8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         NPC_DamageCanCancelIntroPhase;                     // 0x2DE8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_612D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagQuery                     TQ_NPC_DamageTagsThatCanCancelIntroPhase;          // 0x2DF0(0x48)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                GE_NPC_IntroPhaseBehaviorCooldown;                 // 0x2E38(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                 TC_IntroBehaviorActive;                            // 0x2E40(0x20)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         Debug_NPC_AlertLevelForced;                        // 0x2E60(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_612F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UClass*>                        SoundLibs;                                         // 0x2E68(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         NPC_PawnCanInteractInternal;                       // 0x2E78(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6130[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FScalableFloat                        NPC_PrimtiveDataFloatSetRandomlyInRange;           // 0x2E80(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_PrimtiveDataFloatIndexHF;                      // 0x2EA8(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_PrimtiveDataFloatMinRangeHF;                   // 0x2ED0(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_PrimtiveDataFloatMaxRangeHF;                   // 0x2EF8(0x28)(Edit, BlueprintVisible)
	class AActor*                                NPC_Leader;                                        // 0x2F20(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          GameplayCue_LeaderSet;                             // 0x2F28(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                        SoundLibs_Alert;                                   // 0x2F30(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UClass*>                        SoundLibs_Aggressive;                              // 0x2F40(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UClass*>                        SoundLibs_Foley;                                   // 0x2F50(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundBase*                            UnawareStateChangeSound;                           // 0x2F60(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            AlertStateChangeSound;                             // 0x2F68(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            AggressiveStateChangeSound;                        // 0x2F70(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        NPC_Skeletal_Mesh_Index;                           // 0x2F78(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6132[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USoundBase*                            TamedSound;                                        // 0x2F80(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                       StateChangeSound;                                  // 0x2F88(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                        SoundLibs_Foley_Water;                             // 0x2F90(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                CurrentFoleyLib;                                   // 0x2FA0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                CurrentSoundLIb;                                   // 0x2FA8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                        NPC_ShouldDespawnFromStormHF;                      // 0x2FB0(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_DespawnTimerHF;                                // 0x2FD8(0x28)(Edit, BlueprintVisible)
	struct FGameplayTag                          NPC_DespawnGameplayTag;                            // 0x3000(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          NPC_TestIsInSafeZoneTimer;                         // 0x3008(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          NPC_DespawnFromStormTimer;                         // 0x3010(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         NPC_isTryingToDespawn;                             // 0x3018(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6134[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          NPC_ResetIntroGameplayTags;                        // 0x301C(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	float                                        SelectedPrimitiveDataFloat;                        // 0x3024(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          GameplayCue_Death;                                 // 0x3028(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>            OG_Materials;                                      // 0x3030(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         NPC_Apply_GE_for_Swimming;                         // 0x3040(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6135[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UClass*                                NPC_GE_ClassToApplyForSwimming;                    // 0x3048(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Exit_Burst_GC;                                     // 0x3050(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6136[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FActiveGameplayEffectHandle           NPC_GE_AppliedForSwimming;                         // 0x3054(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class FName                                  GoalActorBBKey;                                    // 0x305C(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          GameplayCueLureInterest;                           // 0x3064(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6137[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UObject*                               NPC_PreviousLureGoal;                              // 0x3070(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          Exit_Water;                                        // 0x3078(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          Enter_Water;                                       // 0x3080(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                        NPC_MaxDistanceFromDamagedNPCToDrawHeallthBarHF;   // 0x3088(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_HealthBarHideTimeAfterDeathHF;                 // 0x30B0(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_PlayEffectWhenLuredHF;                         // 0x30D8(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_PawnCanInteractHF;                             // 0x3100(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_AllowInteractOnlyWhenUnawareHF;                // 0x3128(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_AllowInteractWhenHasLeaderHF;                  // 0x3150(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_AllowDrownInShallowWaterHF;                    // 0x3178(0x28)(Edit, BlueprintVisible)
	bool                                         NPC_IsInventoryInitialized;                        // 0x31A0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsGCForLeaderSetLooping;                           // 0x31A1(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6139[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          NPC_DeathByStormTag;                               // 0x31A4(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         NPC_TryDespawnAbility;                             // 0x31AC(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_613A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FActiveGameplayEffectHandle           GeOutsideSafeZoneDamageHandle;                     // 0x31B0(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         IsGEStormDamageInit;                               // 0x31B8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         NPC_MeshScalingInProgress;                         // 0x31B9(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         NPC_DisableCapsuleOverlapsWhenScalingOut;          // 0x31BA(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_613C[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               NPC_OriginalMeshScale;                             // 0x31BC(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            NPCScaleMeshInCompleted;                           // 0x31C8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            NPCScaleMeshOutCompleted;                          // 0x31D8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         NPC_CanDropLoot;                                   // 0x31E8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_613D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FScalableFloat                        NPC_StaleDespawnTestDistance_HF;                   // 0x31F0(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        NPC_StaleDespawnTimeThreshold_HF;                  // 0x3218(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                        NPC_LastNonStaleCheckTime;                         // 0x3240(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bCanBeDamagedByNullInstigator;                     // 0x3244(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsEnteringWater;                                   // 0x3245(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class ANPC_Pawn_Parent_C* GetDefaultObj();

	void GetSoundFoleyLibrary(bool CallFunc_Array_IsValidIndex_ReturnValue, class UClass* CallFunc_Array_Get_Item, class USoundLibrarySubsystem* CallFunc_GetWorldSubsystem_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UClass* CallFunc_Array_Get_Item_1, class USoundLibrarySubsystem* CallFunc_GetWorldSubsystem_ReturnValue_1, bool CallFunc_NotEqual_ClassClass_ReturnValue, class UClass* CallFunc_Array_Get_Item_2, class UClass* CallFunc_Array_Get_Item_3, bool CallFunc_NotEqual_ClassClass_ReturnValue_1, class USoundLibrarySubsystem* CallFunc_GetWorldSubsystem_ReturnValue_2);
	void NPC_CanBeInteractedWith(bool* CanInteract);
